["PANKAJ SHARMA +91 9226915581 | maverickpankaj007@gmail.com PROFILE Results-driven AI/ML and Data Analytics professional with 5+ years of hands-on experience in building machine learning models, PEFT using LoRA, QLoRA for optimisation, building knowledge graph for deeper analysis, extracting actionable insights from data, and deploying end-to-end data solutions. Proven ability to translate business challenges into data-driven strategies using Python, Pytorch, tensorflow, vectorDB, SQL, and advanced ML algorithms. Skilled in data visualization, predictive modeling, and statistical analysis, using langchain, hugging face models, with a strong foundation in mathematics and computer science. Adept at working with cross-functional teams to deliver measurable impact in real-world applications across finance, healthcare, and e-commerce sectors. Using dockers , containers for devops and LoRA, QLoRa, with PEFT for efficeint utilisation of memory and processing, Retrieval-Augmented Generation", "across finance, healthcare, and e-commerce sectors. Using dockers , containers for devops and LoRA, QLoRa, with PEFT for efficeint utilisation of memory and processing, Retrieval-Augmented Generation (RAG), and Multi-Modal AI Systems with expertise in Amazon SageMaker and S3 for data lakes, Power BI tools for data visualization. Experienced in designing and implementing LangGraph-based agentic architectures, refining Reinforcement Learning from Human Feedback (RFHF) pipelines, and conducting experimental ideation-to-finalization workflows for intelligent autonomous systems on Turing’s MLE Bench. CORE COMPETENCIES - Artificial Intelligence & Machine Learning (LLMs, RAG, Guardrails, Agentic AI) - Vector Databases (FAISS, Pinecone) & Knowledge Graphs - Multi-Modal AI Systems (text, vision, structured data) - Predictive Analytics & Decision Support Systems - Railway Safety & Reliability (RAMS) - Project Planning, Execution & Commissioning - Cross-Functional Team Leadership & Innovation -", "structured data) - Predictive Analytics & Decision Support Systems - Railway Safety & Reliability (RAMS) - Project Planning, Execution & Commissioning - Cross-Functional Team Leadership & Innovation - Expertise in Amazon SageMaker and S3 for data lakes - Power BI tools for data visualization PROFESSIONAL EXPERIENCE Indian Railways – Deputy General Manager (DGM) Dec 2013 – Oct 2025 - Spearheaded the first vector database–powered AI system at Indian Railways, enabling real-time retrieval and operational intelligence. - Designed and deployed an agentic RAG framework with re-ranking, guardrails, and data-leak prevention, ensuring secure and context-aware outputs. - Integrated structured, unstructured, and IoT sensor data into multi-modal databases for advanced decision-making. - Led development of predictive maintenance models to forecast accidents, improve asset reliability, and reduce downtime. - Hands-on in building ML pipelines with Python, PyTorch, TensorFlow, SQL, leveraging", "evelopment of predictive maintenance models to forecast accidents, improve asset reliability, and reduce downtime. - Hands-on in building ML pipelines with Python, PyTorch, TensorFlow, SQL, leveraging LoRA/QLoRA, PEFT, Hugging Face, LangChain, and containerized deployment (Docker, Kubernetes). - Collaborated with finance, healthcare, and e-commerce partners to extend AI solutions beyond railways. - Collaborated on the MLE Bench project at Turing, contributing to end-to-end creation, design, reflection, and RFHF fine-tuning of agentic AI models using LangGraph, LangChain, and reinforcement alignment workflows for adaptive reasoning. - Developed modular LangGraph agents capable of multi-step reflection, retrieval-based reasoning, and real-time learning refinement. Compro Technologies – Software Developer Dec 2010 – Dec 2012 - Delivered enterprise-scale web applications using C#, .NET, SQL Server, MySQL, HTML5, jQuery, and Web Services. - Designed and optimized database backends for", "Software Developer Dec 2010 – Dec 2012 - Delivered enterprise-scale web applications using C#, .NET, SQL Server, MySQL, HTML5, jQuery, and Web Services. - Designed and optimized database backends for high-performance systems. - Built strong foundations in SDLC, software design, and system integration. PROJECTS - Agentic AI Pipeline (Turing MLE Bench) – Designed and executed a full-cycle ML experimentation project focusing on ideation, reflection, and RFHF tuning for autonomous agents; built using LangGraph and LangChain for dynamic reasoning, and benchmarked against standardized MLE evaluation metrics. - Decision Support System – Built RAG and PEFT post-trained LLM for decision support using 13 departmental datasets, with evaluation metrics benchmarked using ROUGE and BERTScore. - Railway Chatbot (Agentic RAG System) – Created Indian Railways’ first agentic chatbot handling 100K+ requests daily, leveraging transformers for embeddings, FAISS HNSW for retrieval, and LoRA/QLoRA for", "ailway Chatbot (Agentic RAG System) – Created Indian Railways’ first agentic chatbot handling 100K+ requests daily, leveraging transformers for embeddings, FAISS HNSW for retrieval, and LoRA/QLoRA for efficient fine-tuning. - AI Decision Support System – Created a vector DB integrating multiple data sources; delivered predictive analytics for accident trends and asset maintenance forecasting. EDUCATION - B.Tech, Electronics & Communication Engineering – Ajay Kumar Garg Engineering College, Ghaziabad | 2010 | 80.08% - XII – KDB Public School, Ghaziabad | 2006 | 81.4% (CBSE) - X – Ingraham Institute, Ghaziabad | 2004 | 79.8% (ICSE) GLOBAL CERTIFICATION & TRAINING - AWS S3, Sagemaker certification - 18-Months Training, Indian Railways: RRI (German & British), EI (Microlok, Westrace, SIMIS S20), SDH STM, ERTMS L1/2/3, CBTC, GSM-R. - Equivalent to IRSE Certification eligibility. KEY STRENGTHS - AI Solutions Architect & Innovator - Railway Digital Transformation Specialist - Strategic", "MIS S20), SDH STM, ERTMS L1/2/3, CBTC, GSM-R. - Equivalent to IRSE Certification eligibility. KEY STRENGTHS - AI Solutions Architect & Innovator - Railway Digital Transformation Specialist - Strategic Leader with Execution Focus - Passion for Emerging Technologies Ghaziabad, U.P. | Nationality: Indian"]