["PANKAJ SHARMA +91 9226915581 | maverickpankaj007@gmail.com PROFILE Results-driven AI/ML and Data Analytics professional with 5+ years of hands-on experience in building machine learning models, PEFT using LoRA, QLoRA for optimisation, building knowledge graph for deeper analysis, extracting actionable insights from data, and deploying end-to-end data solutions. Proven ability to translate business challenges into data-driven strategies using Python, Pytorch, tensorflow, vectorDB, SQL, and advanced ML algorithms. Skilled in data visualization, predictive modeling, and statistical analysis, using langchain, hugging face models, with a strong foundation in mathematics and computer science. Adept at working with cross-functional teams to deliver measurable impact in real-world applications across finance, healthcare, and e-commerce sectors. Using dockers , containers for devops and LoRA, QLoRa, with PEFT for efficeint utilisation of memory and processing, Retrieval-Augmented Generation", "across finance, healthcare, and e-commerce sectors. Using dockers , containers for devops and LoRA, QLoRa, with PEFT for efficeint utilisation of memory and processing, Retrieval-Augmented Generation (RAG), and Multi-Modal AI Systems with expertise in Amazon SageMaker and S3 for data lakes, Power BI tools for data visualization. Experienced in designing and implementing LangGraph-based agentic architectures, refining Reinforcement Learning from Human Feedback (RFHF) pipelines, and conducting experimental ideation-to-finalization workflows for intelligent autonomous systems on Turing’s MLE Bench. CORE COMPETENCIES - Artificial Intelligence & Machine Learning (LLMs, RAG, Guardrails, Agentic AI) - Vector Databases (FAISS, Pinecone) & Knowledge Graphs - Multi-Modal AI Systems (text, vision, structured data) - Predictive Analytics & Decision Support Systems - Railway Safety & Reliability (RAMS) - Project Planning, Execution & Commissioning - Cross-Functional Team Leadership & Innovation -", "structured data) - Predictive Analytics & Decision Support Systems - Railway Safety & Reliability (RAMS) - Project Planning, Execution & Commissioning - Cross-Functional Team Leadership & Innovation - Expertise in Amazon SageMaker and S3 for data lakes - Power BI tools for data visualization PROFESSIONAL EXPERIENCE Indian Railways – Deputy General Manager (DGM) Dec 2013 – Oct 2025 - Spearheaded the first vector database–powered AI system at Indian Railways, enabling real-time retrieval and operational intelligence. - Designed and deployed an agentic RAG framework with re-ranking, guardrails, and data-leak prevention, ensuring secure and context-aware outputs. - Integrated structured, unstructured, and IoT sensor data into multi-modal databases for advanced decision-making. - Led development of predictive maintenance models to forecast accidents, improve asset reliability, and reduce downtime. - Hands-on in building ML pipelines with Python, PyTorch, TensorFlow, SQL, leveraging", "evelopment of predictive maintenance models to forecast accidents, improve asset reliability, and reduce downtime. - Hands-on in building ML pipelines with Python, PyTorch, TensorFlow, SQL, leveraging LoRA/QLoRA, PEFT, Hugging Face, LangChain, and containerized deployment (Docker, Kubernetes). - Collaborated with finance, healthcare, and e-commerce partners to extend AI solutions beyond railways. - Collaborated on the MLE Bench project at Turing, contributing to end-to-end creation, design, reflection, and RFHF fine-tuning of agentic AI models using LangGraph, LangChain, and reinforcement alignment workflows for adaptive reasoning. - Developed modular LangGraph agents capable of multi-step reflection, retrieval-based reasoning, and real-time learning refinement. Compro Technologies – Software Developer Dec 2010 – Dec 2012 - Delivered enterprise-scale web applications using C#, .NET, SQL Server, MySQL, HTML5, jQuery, and Web Services. - Designed and optimized database backends for", "Software Developer Dec 2010 – Dec 2012 - Delivered enterprise-scale web applications using C#, .NET, SQL Server, MySQL, HTML5, jQuery, and Web Services. - Designed and optimized database backends for high-performance systems. - Built strong foundations in SDLC, software design, and system integration. PROJECTS - Agentic AI Pipeline (Turing MLE Bench) – Designed and executed a full-cycle ML experimentation project focusing on ideation, reflection, and RFHF tuning for autonomous agents; built using LangGraph and LangChain for dynamic reasoning, and benchmarked against standardized MLE evaluation metrics. - Decision Support System – Built RAG and PEFT post-trained LLM for decision support using 13 departmental datasets, with evaluation metrics benchmarked using ROUGE and BERTScore. - Railway Chatbot (Agentic RAG System) – Created Indian Railways’ first agentic chatbot handling 100K+ requests daily, leveraging transformers for embeddings, FAISS HNSW for retrieval, and LoRA/QLoRA for", "ailway Chatbot (Agentic RAG System) – Created Indian Railways’ first agentic chatbot handling 100K+ requests daily, leveraging transformers for embeddings, FAISS HNSW for retrieval, and LoRA/QLoRA for efficient fine-tuning. - AI Decision Support System – Created a vector DB integrating multiple data sources; delivered predictive analytics for accident trends and asset maintenance forecasting. EDUCATION - B.Tech, Electronics & Communication Engineering – Ajay Kumar Garg Engineering College, Ghaziabad | 2010 | 80.08% - XII – KDB Public School, Ghaziabad | 2006 | 81.4% (CBSE) - X – Ingraham Institute, Ghaziabad | 2004 | 79.8% (ICSE) GLOBAL CERTIFICATION & TRAINING - AWS S3, Sagemaker certification - 18-Months Training, Indian Railways: RRI (German & British), EI (Microlok, Westrace, SIMIS S20), SDH STM, ERTMS L1/2/3, CBTC, GSM-R. - Equivalent to IRSE Certification eligibility. KEY STRENGTHS - AI Solutions Architect & Innovator - Railway Digital Transformation Specialist - Strategic", "MIS S20), SDH STM, ERTMS L1/2/3, CBTC, GSM-R. - Equivalent to IRSE Certification eligibility. KEY STRENGTHS - AI Solutions Architect & Innovator - Railway Digital Transformation Specialist - Strategic Leader with Execution Focus - Passion for Emerging Technologies Ghaziabad, U.P. | Nationality: Indian", "दक्षऺण पूर्व मध्य रेऱर्े SOUTH EAST CENTRAL RAILWAY श्री. जितेन्द्र नाथ ततर्ारी, सहायक मंडऱ संकेत एर्ं दूरसंचार इंिीतनयर, गोंददया के द्र्ारा ददनांक. 23.02.2024 को “मुडडपार” स्टेशन का र्ार्षवक तनरीऺण ANNUAL INSPECTION NOTE OF SHRI. JITENDRA NATH TIWARI, ADSTE-I/G AT “MURHIPAR” STATION ON 23.02.2024. Last Date of Annual Inspection 24.02.2023 A1.0 Major deficiencies noted: Action by TDC A1.1 No AT supply in old Goomty East & West. ADEE/G A1.2 At gate goomty LC-454, no AT supply is there. ADEE/G A1.3 In SM room CLS panel not working in Auto mode at MUP . ADEE/G B1.0 Point machine deficiencies: B1.1 Point 42A : 1 no. hole for GTP insulation required ADEN/DGG SSE/S/DGG JE/SIG/RSM B1.2 Point 43B– Burr formation on LH side stock rail ADEN/DGG SSE/S/DGG JE/SIG/RSM B1.3 Point 33A- Packing required. ADEN/DGG SSE/S/DGG JE/SIG/RSM B1.4 Point 32A-Bur formation in LH and RH stock rails ADEN/DGG SSE/S/DGG JE/SIG/RSM B1.5 34A-Burr formation in RH stock rail. ADEN/DGG SSE/S/DGG JE/SIG/RSM For", "required. ADEN/DGG SSE/S/DGG JE/SIG/RSM B1.4 Point 32A-Bur formation in LH and RH stock rails ADEN/DGG SSE/S/DGG JE/SIG/RSM B1.5 34A-Burr formation in RH stock rail. ADEN/DGG SSE/S/DGG JE/SIG/RSM For lighting?? B1.6 41A-Burr formation in LH stock rail. ADEN/DGG SSE/S/DGG JE/SIG/RSM C1.0 Other Deficiencies: C1.1 IPS battery –in Centre IPS battery is connected with single wire, from battery terminal to SMR. SSE/S/RJN JE/S/RSM 15.3.24 C1.2 Wire Mesh required in IPS room. SSE/S/RJN JE/S/RSM 31.3.24 C1.3 32AT- Track ckt TLJB broken, to be replaced SSE/S/RJN JE/S/RSM 15.3.24 C1.3 31AT-Track ckt TLJB broken and fastened with wire- to be replaced. SSE/S/DGG JE/SIG/RSM C1.4 33A cross over single wire bonding. SSE/S/DGG JE/SIG/RSM C1.5 West Goomty stairs broken. ADEN/DGG C1.6 One Ceiling fan required in west goomty. ADEE/NGP C1.7 Painting of location box, points and signals are required. SSE/S/DGG JE/SIG/RSM Summary for the whole jurisdiction: Total deficiencies noted till date (2023-24) =36", "uired in west goomty. ADEE/NGP C1.7 Painting of location box, points and signals are required. SSE/S/DGG JE/SIG/RSM Summary for the whole jurisdiction: Total deficiencies noted till date (2023-24) =36 Total deficiencies complied =9 Balance deficiencies to be complied =27 Forwarded with remarks whether quality of inspection is SATISFACTORY/NOT SATISFACTORY. Sr. DSTE/NGP ADSTE-I/Gondia Must be done that day only satisfactory with remarks by pankaj sharma Supervisor & Staff present during the Inspection: 1. Shri. Abhishek Thakur (JE/SIG/RSM) 2. Shri. Brij kumar Bohat (Sr. Tech/SIG/MUP) 3. Shri. Yogesh Chelak (ESM-I/SIG/MUP) 4. Shri. Sagar Chouhan (ESM-III/SIG/MUP) 5. Shri. Jitenra Chandel (Assistant/MUP) 6. Shri. Shiv Prashad Yadav( Assistant/RSM) 7. Shri Tekchand, Asst/G 1. Brief on the Installation being inspected- 1.1 Date of commissioning of the Installation : i. “MUP” station was commissioned on 12.02.2018 with total routes 56 as per approved SIP. ii. Auto section between “MUP-RSM”", "stallation being inspected- 1.1 Date of commissioning of the Installation : i. “MUP” station was commissioned on 12.02.2018 with total routes 56 as per approved SIP. ii. Auto section between “MUP-RSM” was commissioned on 04.07.2022 up and dn lin e by Proj. NGP and joint line on 12.02.2018”and “MUP-PMS” up and dn lin e was commissioned on 04.07.22 by CONST. BIA by proj. NGP and joint line on 04.07.2022 by const. BIA. iii. Tentative Approved drawings up to last commissioning was available at station. iv. Date of commissioning of the installation (PI/EI/RRI, IBS, Interlocked LC gates, Auto section etc. as applicable). V. Whether approved drawing of to last commissioning available ( for item i to iv) DOM/NGP ARM/G SSE/SIG/RJN iii. Yes iv.10.09.2020 v.Yes 1.2 Sr.No. Description Features DOM/NGP ARM/G SSE/SIG/RJ N 1 Class of station SPL 2 Type of signaling MACLS 3 Standard of inter locking III(R) 4 Block signaling Automatic 5 No. of EI Rack 05 Nos. 6 No. of running line 06 Nos. 7 No. of", "M/NGP ARM/G SSE/SIG/RJ N 1 Class of station SPL 2 Type of signaling MACLS 3 Standard of inter locking III(R) 4 Block signaling Automatic 5 No. of EI Rack 05 Nos. 6 No. of running line 06 Nos. 7 No. of routes 56 8 Optg.VDU Dual 55 inch 9 Auto VDU 01 No. 43 inch 10 MSDACEC 16 Nos. 11 ELD 03 Nos. 12 No. of Motor point 17 Nos. 13 No. of Track circuits 33 Nos. 14 No. of Total Signals: 22+6 (Road signal) a Main Signal 14 nos. b Calling/On 02 nos. c Shunt signal Independent shunt-05 Dependent shunt-01 15 LC gate 03 Nos.(ELB), 451,453,454. 16 IPS & make 01Nos.(StatCon Make at center) 02 Nos (HBL) at Gate 17 Data logger 05 Nos.(Efftronics make) 18 Air Conditioning Not Available 19 Fire alarm system Provided 20 EI Maintenance PC 01 Nos. 21 Data Logger Maintenance PC Available 22 Type of Interlocking Electronic Interlocking 23 Date of commissioning 12.02.2018 2. Essential Drawings/Documents/ Records as applicable: 2.1 Approved SIP/ RCC/FPD/VDU layout/ SWR/SWRD Site Condition Available", "Interlocking Electronic Interlocking 23 Date of commissioning 12.02.2018 2. Essential Drawings/Documents/ Records as applicable: 2.1 Approved SIP/ RCC/FPD/VDU layout/ SWR/SWRD Site Condition Available SSE/SIG/RJN 2.2 Date of commissioning of the installation (PI/EI/RRI, IBS, Interlocked LC gates, Auto section etc. as applicable) i. Relay rack layout & Relay Disposition plan ii. Cable termination detail in Relay Rooms. iii. Relay contact analysis chart iv. Power supply Distribution plan. v. Location wiring/ termination particular vi. Cable corage plan. vii. Cable route plan. viii. Track bonding Diagram i.Available ii.Available iii Available iv. Available v.Available vi. Available vii. Available SSE/SIG/RJN JE/SIG/RSM 2.3 Updated Checksum/CRC of EI was available at site. SSE/S/RJN JE/SIG/RSM System Checksum CRC C1 3481 6994 C2 877e 8113 C3 Doco ec69 C4 e974 0b40 C5 7acb 0fd9 2.4 Previous inspection report of Sr. Officers of S&T & Other deptt (for observation on S&T items) & compliance", "RSM System Checksum CRC C1 3481 6994 C2 877e 8113 C3 Doco ec69 C4 e974 0b40 C5 7acb 0fd9 2.4 Previous inspection report of Sr. Officers of S&T & Other deptt (for observation on S&T items) & compliance report - SSE/S/RJN JE/SIG/RSM 2.5 Compliance of CMS report pertaining to the Station/Section. -- SSE/S/RJN JE/SIG/RSM 2.6 Competency Cum training history book for maintainers Available SSE/S/RJN JE/SIG/RSM 2.7 Assurance certificates from staff Available With SSE SSE/S/RJN JE/SIG/RSM 2.8 Last Annual Inspection report of Sectional officer & Compliance there of. 23-02-2024 Compliances done SSE/S/RJN JE/SIG/RSM 2.9 Pre-commissioning checklist i. EI ii. IPS iii. Data Logger iv. SSDAC - NA v. MSDAC Not available Vi. MF earth Vii. Any other equipment. i. NA ii. NA iii. NA iv. NA v.NA vi. NA vii. NA SSE/S/RJN JE/SIG/RSM 2.10 Records & Registers- i. Deficiency cum compliance register. ii. Signal failure Register iii. Officer’s Inspection Register iv. Joint Point & Crossing Inspection Register. v.", "SSE/S/RJN JE/SIG/RSM 2.10 Records & Registers- i. Deficiency cum compliance register. ii. Signal failure Register iii. Officer’s Inspection Register iv. Joint Point & Crossing Inspection Register. v. Quarterly Joint Footplate Inspection Reports at SSE/Sig/DTI/LI level in the section. vi. Asset Register vii. Relay Room/Goomties key register. viii. Disconnection/ Reconnection Register. ix. Cable meggering register- x. Record of SIT of station. xi. IPS battery maintenance register. xii. Various Veeder Counter Register. xiii. AMC register of Equipments. xiv. Earth Testing Register. xv. Summer & Monsoon precaution register (As per latest instruction by Board)-. Apart from above standard records & Registers, various maintenance Registers/ Cards of Signalling gears & Equipments (such as SSDAC, MSDAC, IPS, Point machines, Data Logger, LC gates, Block Inst., Track circuit, ELD, UFSBI, Colour light Signals, Control Panel, Cables etc) may also be checked. i. Available ii. Available iii Avl and", "MSDAC, IPS, Point machines, Data Logger, LC gates, Block Inst., Track circuit, ELD, UFSBI, Colour light Signals, Control Panel, Cables etc) may also be checked. i. Available ii. Available iii Avl and updated iv Avl. With SSE/DGG v. Avl vi Avl vii Avl viii Avl xi. Avl xi. NA xii.Avl with SM xiv. Avl and updated xv. Not Avl SSE/S/RJN JE/SIG/RSM 3. SM’s Room: 3.1 i. On duty Station Master, Shri. Nirmala Shrivas was in proper uniform and he was alert on duty. ii. competency of SM: not due DOM/NGP ii. Misc check on knowledge of SM on his response and command ( various emergency operations) iv. He had good knowledge of railway working. PME Done on :- 11.02.23 Due on:-12.02.27 Refresher Course Done on:- NA Due on :- 05.06.2026 Station Master was asked about emergency Crank handle and his answer was satisfactory. v. Station Master was asked about Jointly Correspondence Test Before Reconnection and his answer was satisfactory. 3.2 CLS Panel i. Location of CLS Panel – It’s indications is", "answer was satisfactory. v. Station Master was asked about Jointly Correspondence Test Before Reconnection and his answer was satisfactory. 3.2 CLS Panel i. Location of CLS Panel – It’s indications is clearly visible to SM as he performs his duty. CLS Panel to be provided in ESM/IPS room at Goomties. ii. Power supply instructions in Hindi are pasted on CLS Panel iii. MCBs are of adequate rating iv. Bi metallic strips are provided v. All cables/wires are properly soldered/dressed inside & outside CLS Panel without any open joint vi. Any sign of burning or spark in the cable connection & terminals vii. Joint Procedure order for electrical safety Audit of RRI/EI/PI (No: SECR/Elect/427 dtd. 03.08.2015 is being followed viii. Power to be extended to IPS from CLS Panel ix. Deficiency - Seen Not working DNAT in Auto mode. i. Panel and its indications are clearly visible Not applicable ii. pasted ADEE/ G SSE/S/RJN iii. yes iv.NA v. yes vi. No vii. Yes JPO followed viii. stand by not 3.3 CCIP", "t working DNAT in Auto mode. i. Panel and its indications are clearly visible Not applicable ii. pasted ADEE/ G SSE/S/RJN iii. yes iv.NA v. yes vi. No vii. Yes JPO followed viii. stand by not 3.3 CCIP (Wherever available) i. Layout matching with SIP ii. ii. Cleanliness of Panel top cover. iii. Earthing connectivity to Panel being intact. iv. Proper sealing of Emergency operation buttons. -. Availability of button collars- Yes vi. Flashing indication or Audio visual alarm are available for ATs at connected IBS & Auto huts ( HQ policy 03/2014) vii. All indications are illuminating properly viii. Flasher indications are in working order. ix. On opening the back cover, wiring to be in good laid out/dressed condition without any opening to avoid rodent entry. x. Buttons & Keys are functioning properly (without having stuck up tendency). xi. All Audio/Visual alarms & counters are functional and their readings are tallying with registers. xii. Redundant power supply to Panel processor (if", "ng properly (without having stuck up tendency). xi. All Audio/Visual alarms & counters are functional and their readings are tallying with registers. xii. Redundant power supply to Panel processor (if available). xiii. Switching over control from CCIP to VDU is working satisfactorily- xiv. Emergency Crank handle release under route locked condition/under failure of EI, working satisfactorily. xv. Requirement of spares & any other miscellaneous check. Not available 3.4 VDU (Main & Std By) i. Layout is matching with SIP. ii. Cleanliness of VDUs. Resolution is optimum. iii. Wiring inside cupboard in good laid out/dressed condition without any opening to avoid rodent entry. FMS/Switches/DC-DC converters inside cupboard are neatly placed without accumulation of dust over them. iv. Availability of spare mouse & key boards for emergency. v. Absolute segregation of power supply between VDUs and accessories (SECR/Policy circular 02/2020) in case of Dual VDU arrangement/110V for VDU segregated.", "of spare mouse & key boards for emergency. v. Absolute segregation of power supply between VDUs and accessories (SECR/Policy circular 02/2020) in case of Dual VDU arrangement/110V for VDU segregated. vi. Operating PCs (Industrial grade) are of standard make & capacity (TAN 3007). History of previous i. Yes ii. Good iii. Yes iv. Not Available v. Yes vi.No failure TDC?? failures in PCs/rectification/replacement details. vii. All EI related indications/buzzers are available & SM is conversant with it (On line/Off line, Redundant link failure, Mismatch error, DC-DC conv. failure etc). viii. Flashing indication or Audio visual alarm are available to give alerts on failure of ATs at connected IBS & flashing indication only on failure of ATs at Auto huts provided with RTU ( HQ policy 03/2014)-. ix. Switching over of control from VDU to VDU is working satisfactorily/switching over is being done once in 24 hrs. x. Standby VDU monitor to be kept off with its CPU being on so that operation can", ". ix. Switching over of control from VDU to VDU is working satisfactorily/switching over is being done once in 24 hrs. x. Standby VDU monitor to be kept off with its CPU being on so that operation can be shifted to Standby monitor by switching it on through remote. xi. Requirement of spares & any other miscellaneous check. vii. Available viii. Yes ix. Yes x. Yes xi. One auto VDU, mouse, keyboard required. Spare. 3.5 Block Instruments/Block Panels a. DLBI i. DOH/Next due date. ii. Proper working of SM’s Lock up key. iii. All Earthing are intact (Commutator Earth, PR Earth & Filter unit Earth) & measurement of Earth values are satisfactory. iv. 3 position relays are under sealed cover. v. Locking & sealing are intact. Cross checking of Door lock keys & SM’s keys of one instrument with other instrument. vi. Polarised relay is returning to normal without line current. vii. Block telephones are in perfect order. viii. Commutator handle is getting locked when turned from LC to TOL. ix.", "other instrument. vi. Polarised relay is returning to normal without line current. vii. Block telephones are in perfect order. viii. Commutator handle is getting locked when turned from LC to TOL. ix. Block Local/Block line voltages are optimum. x. Block free indication is not faulty. xi. Wiring inside Filter unit are in perfect order without dust. xii. Verify safety check/maintenance by staff as per periodicity. xiii. High Reliability Block release circuit/TOLR circuit. xiv. Previous failures of block instruments. xv. Check that LSS can not be taken off without Line Clear. xvi. Requirement of spares & any other miscellaneous check xvii. Full deflection of needle. a .NA SSE/S/RJN JE/SIG/RSM b. TLBI i. DOH/Next due date ii. All Earthing are intact (Filter Unit earth & Equipment earth) iii. Proper working of SM’s Lock up key. iv. Locking & sealing are intact. v. Full deflection of needle indicator. vi. All relays inside the instrument are properly plugged with holding clips being", "h) iii. Proper working of SM’s Lock up key. iv. Locking & sealing are intact. v. Full deflection of needle indicator. vi. All relays inside the instrument are properly plugged with holding clips being intact. from SM‟s table. Working of releasing/locking of shunting key. viii. Cancellation timer is functional. ix. Measurement of Earth values. x. Block telephones are in perfect order. xi. Reliability of power supply arrangements. xii. Working of counters. xiii. Latest readings of line current/voltage/frequency at both receiving and transmitting end. xiv. Verify safety check/maintenance by staff as per periodicity. xv. Check by turning block handle with/without cooperation from other station. xvi. Previous failures of Block instrument for last 1 year. xvii. Check that LSS can not be taken Off without line clear. xviii. Requirement of spares & any other miscellaneous check. c. SLBP/DLBP & UFSBI (in relay/EI room) i. Visual inspection of Block Panel. Panel buttons/ Keys/ Indications are", "Off without line clear. xviii. Requirement of spares & any other miscellaneous check. c. SLBP/DLBP & UFSBI (in relay/EI room) i. Visual inspection of Block Panel. Panel buttons/ Keys/ Indications are intact and in working order. ii. Failure Indications/ buzzers in Alarm Panel are in working order (Single CPU fail, Redundant DC-DC cov. Fail & Link failure) b. NA c. NA iii. PF contacts of Alarm Panel of UFSBI are wired in Data logger. iv. Block Telephone in perfect order. v. Effective working of SM’s key, LCB key, SH key & RKT for SLBP. vi. Media diversity available (Qd & OFC) & media changeover switch is available in SM’s room. vii. Check media diversity. viii. All relays in UFSBI rack are properly plugged with holding clips being intact/ Working voltage/Current to UFSBI. ix. Output range of various voltage levels of DC-DC conv. card. x. Latest Quad cable/Communication channel testing records (by SSE/JE/Tele). xi. Previous failures of SLBP/DLBP for last 1 year. xii. Verify safety", "range of various voltage levels of DC-DC conv. card. x. Latest Quad cable/Communication channel testing records (by SSE/JE/Tele). xi. Previous failures of SLBP/DLBP for last 1 year. xii. Verify safety check/maintenance of staff as per periodicity. xiii. Check that LSS can not be taken Off without Line clear. xiv. Cancellation timer is working perfectly. xv. Earth resistance (UFSBI) should be less than 1ohm-0.5 ohm xvi. Media diversity for main & standby BPAC- one on Quad cable with the other one being on OFC or both on OFC channels derived from two different MUX/Maple (where use of Quad cable is not feasible/applicable) xix. Requirement of spares & any other miscellaneous check. d. Other Misc inspections i. Well framed yard layout diagram (Similar to Bandel yard/E.Rly) as communicated vide HQ ltr no.SECR/ S&T/ Yard layout/1314 dtd. 09.02.2023, available in SM’s room. ii. Fire Alarm system are provided and in working order iii. Alarm Panels of IPS (All IPS)/Fire Alarm system/Fuse", "ed vide HQ ltr no.SECR/ S&T/ Yard layout/1314 dtd. 09.02.2023, available in SM’s room. ii. Fire Alarm system are provided and in working order iii. Alarm Panels of IPS (All IPS)/Fire Alarm system/Fuse Changeover system/ELDs, media changeover switch (UFSBI) etc are located at appropriate places and are in working order. iv. Sealing of Crank handle boxes (if available). v. Check working of Fire Alarm Panel. vi. Adequate lighting of SM’s room. vii. Neatness of telecom wiring. viii. Arrangement of Telephones, Block instruments/Block Panels, A/c Reset boxes etc around CCIP are in order. ix. VHF sets, Walkie-Talkie sets/ Gate/IB Telephone, Control Phones are in perfect order without noise. Selected supply available for VHF Availability of Std by Section Control Telephones/Gate telephones. x. Standby Control telephones/Gate telephones are kept away from SM’s table. xi. Any other misc check.sets/Control phones. i. Yard lay out avl. ii. provided and working iii. yes iv.yes v.working", "ones. x. Standby Control telephones/Gate telephones are kept away from SM’s table. xi. Any other misc check.sets/Control phones. i. Yard lay out avl. ii. provided and working iii. yes iv.yes v.working vi.Adequate vii.neat viii.Telephone s-ok,BI, CCIP-NA ix. in order x.Yes xi.No 4. Relay/Electronic Interlocking: 4.1 a. Relay/EI room i. Cleanliness of the Room & Equipment ii. Check for any crack/seepage and issues for urgent attention Crack on wall of window iii. Condition of windows & main door-Good iv. Working of Fan/ACs/Exhaust Fans/ other Electrical fittings and their adequacy in provision (AC to be provided in all EI rooms)-Good v. Power Supply & Switch for ACs should be outside Relay/EI room-NA vi. ACs are installed on the wall away from Equipments & wirings/4ft clearance is available between the equipment’s & the wall (on which ACs are fitted)/ no leakage water from AC inside the room vii. Lighting of Relay/EI room is 100% on AT supply. viii. Fire Alarm system provided and in", "able between the equipment’s & the wall (on which ACs are fitted)/ no leakage water from AC inside the room vii. Lighting of Relay/EI room is 100% on AT supply. viii. Fire Alarm system provided and in working order. ix. Adequacy of floor space and height of building- Yes x. Plugging holes for rodent entry-yes xi. Relay/EI room double locked with Door sensor being wired in Data logger and working satisfactorily-yes xii. Any other miscellaneous check. b. Relay Interlocking (Plug in type) i. Visual inspection on condition of all relays (very old relays to be replaced as prudence, fungus, ant ingress, retaining clips, sealing are intact wherever applicable, loose/tilted, label on relays, charring of cover near contacts, cracks in components, black i. Clean ii. crack in Window iii. Good vi Working v. NA vi. NA vii. Ye s Viii. Yes xi. Yes x. Yes xi. Yes xii. Mesh Provided. b.NA SSE/S/RJN JE/SIG/RSM AEN/DGG spots etc)/Sealing of Pt group relays. ii. Bunching/availability of ferules/lacing of", "king v. NA vi. NA vii. Ye s Viii. Yes xi. Yes x. Yes xi. Yes xii. Mesh Provided. b.NA SSE/S/RJN JE/SIG/RSM AEN/DGG spots etc)/Sealing of Pt group relays. ii. Bunching/availability of ferules/lacing of wires over ladders and near relay bases. Visually suspected loops/bypass arrangements. iii. Accuracy/availability of time delay circuits (120 secs/60 secs as applicable) iv. Sample check on final functional relay voltages for large circuits catering to multiple relay contacts in series. v. Verifying records of relay contact failure cases pertaining to the installation. vi. All relays are wired in Data logger/RTU. Relay non operated status checked for last 1 month. Validation report. vii. Intactness of Earthing to racks/cable armour/other equipments inside Relay room (Data loggers, UFSBI, RTUs etc) and sample check on earth values/connection of earth at Earth pits (intactness/rusty/loose) viii. Record of latest SIT. ix. Visual inspection of all fuses/terminations (proper rating/ rigidity", "Us etc) and sample check on earth values/connection of earth at Earth pits (intactness/rusty/loose) viii. Record of latest SIT. ix. Visual inspection of all fuses/terminations (proper rating/ rigidity of connections, trace of sparking/black spots etc) x. Voltage level at busbars of Relay Int/Ext, 110V AC/DC, 230V AC etc (as applicable). Its analog monitoring through Data logger. xi. Power segregation available (For redundant systems) xii. Proper gauge of power cables. xiii. FACS are provided adequately. xiv. High reliability Block release/TOLR ckt/Modified Calling on ckt/High reliability Signal lighting ckt/elimination of Adv Str replacement track ckt/calling on timer ckt (60 secs or 120 secs as applicable) etc available. xv. Requirement of spares & any other miscellaneous check c. Electronic Interlocking (Generic items for all make EIs) i. Representative of OEM to accompany the inspection. ii. Check AMC register and maintenance log sheet filled by OEM in latest visit. iii. ACs to be", "ronic Interlocking (Generic items for all make EIs) i. Representative of OEM to accompany the inspection. ii. Check AMC register and maintenance log sheet filled by OEM in latest visit. iii. ACs to be provided in all EI room irrespective of no of routes. iv. All modules are free from dirt/dust and are inserted properly. v. Refer para 4.1b(i) for visual inspection of Relays. vi. Visual inspection for intactness of identification markers/labels at all terminals. vii. Visual checking of indication of Comm. Switches. viii. Check that unused slots are covered with blank plates. ix. Check voltage levels at supply terminals (Refer para D1bx) x. Power from IPS to EI is extended by 4x16 Sqmm copper cable. xi. FANs provided for EI & Embedded PCs (provided in cupboard) are in working order. xii. Visual checking of all indications on EI equipments. xiii. Patch cords used in EI should not be under tension/bent condition. xiv. Bit chart of appropriate size is fixed on EI rack/at a suitable place.", "isual checking of all indications on EI equipments. xiii. Patch cords used in EI should not be under tension/bent condition. xiv. Bit chart of appropriate size is fixed on EI rack/at a suitable place. xv. Testing of voltage at test points on EI modules (Sample check). xvi. Ensure that PCs of Optg/maintenance terminals are not loaded with external software. xvii. Check for proper functioning of MT. xviii. Fuse Alarm systems are provided including i. YES ii. Provide iii.Dust free dust free iv. ok v. done, ok vii.ok viii.yes x. yes xi. working xii. ok xiii. not in tension xiv. fixed xv. done xvi. checked xvii.checked signal lighting circuits. xix. Checking for all fuses and its indications. xx. BRC & its connectivity to ring earth & EI equipments/Racks are intact with wires of suitable gauge as per RDSO guidelines (TAN 3006). xxi. Measured value of Ring Earth (should be less than 1 ohm) xxii. A Class protection is connected to separate Earth electrode (MF) other than Ring earth. Surge", "uge as per RDSO guidelines (TAN 3006). xxi. Measured value of Ring Earth (should be less than 1 ohm) xxii. A Class protection is connected to separate Earth electrode (MF) other than Ring earth. Surge counter is in working condition. xxiii. Records on failure due to lightning for last 1 year/causes/action taken/suggestions. xxiv. All external relays are wired in Data logger/RTU. Validation report. xxv. Last record of system changeover (to be redone if required). xxvi. Power supply to EI is through duplicate cables. xxvii. Intactness of all surge protection devices for EI equipments. xxviii. Powering of PC monitors through 110V AC. xxix. Firmware version update done (As applicable)’ xxx. Last record on SIT xxxi. Availability of anti static ESD wrist straps. xxxii. OFC laid for communication between Goomty & Central EI (for distributed architecture is in shape of ‘8’. xxxiii. Records on OFC damage for last 1 year. xxxiv. Specific checking of parameters typical to make of EI being", "nication between Goomty & Central EI (for distributed architecture is in shape of ‘8’. xxxiii. Records on OFC damage for last 1 year. xxxiv. Specific checking of parameters typical to make of EI being inspected as per maintenance log sheet. xxxv. Safe storage of spare EI cards available at the xviii.NOT PROVIDED xix.checked xx.intact xxi. less than1 xxii.avl xxiii.no xxiv.ys xxv. checked xxvi.checke d xxvii.intact xxviii. avl xxix. planned 7.7 to be done XXX. Not avl. xxxi. avl XXXii. Available Xxxiii. No OFC DAMAGE xxxiv. yes XXXv. At Store Reading of OFC carried out or not installation. xxxvi. Spare CPU card is loaded with running application logic for quick resumption of EI on failures of CPU cards. xxxvii. Records on all types of failures in EI for last 1 year/causes/action taken/suggestions. xxxviii.Competency of staff. xxxix. Requirement of spares & any other miscellaneous check. xxxvi. Not done xxxvi. provided xxxvii. Avl Avl with EI agency 5. IPS: 5.1 i. Check AMC register and", "estions. xxxviii.Competency of staff. xxxix. Requirement of spares & any other miscellaneous check. xxxvi. Not done xxxvi. provided xxxvii. Avl Avl with EI agency 5. IPS: 5.1 i. Check AMC register and maintenance log sheets filled by OEM in last visit. ii. Adequate lighting and working condition of exhaust fan iii. No dust accumulation on IPS equipments-yes iv. IPS front panel indications (ACDP/DCDP) are proper Indications are proper on all modules v. Checking wires/connectors/terminations inside IPS cabinets. No visually loose concetions/smoke/black spots at I/O links. Connectivity to power distribution rack (if provided) are through wires of proper gauge as per load level- yes vi. DC-DC converters are provided in N+ 2 configurations for internal/External circuits. Segregated supply for Block /BPAC /UFSBI /MSDAC with redundant modules. Supply arrangement of BPAC (A&B) systems on UP/DN/Jt lines are as per HQ policy. Check for abnormal heating of modules vii. Check I/P load to IPS from", "Block /BPAC /UFSBI /MSDAC with redundant modules. Supply arrangement of BPAC (A&B) systems on UP/DN/Jt lines are as per HQ policy. Check for abnormal heating of modules vii. Check I/P load to IPS from AC mains. Range of AC I/P voltage (170V-275V) viii. Check AC/DC loads on IPS. No of SMRs- adequate/surplus ix. Availability of spare Modules in wired slots on ACDP/DCDP i. Checked last visit 22.02.2024 ii. Good iii. Ye ss iv.yes v. no visually loose, wire of proper gauge vi. N+2 for internal, N+1 for external, no modules heating. vii. Checked i/o: 240VAC viii.Adequate ix.spare avl ADEE/G SSE/S/RJN JE/SIG/RSM x. Insulation of wiring ladder from IPS cabinets xi. Earth connectivity to IPS cabinet to be intact xii. Proper functioning of status monitoring panel (to be at SM room) xiii. Check for cleanliness of IPS room. cracks/seepage/entry for rodents etc-yes xiv. Check SPD Box. Earthing to be intact and proper. Indications in SPDs to be checked. Non- Indicative type SPDs to be tested by SPD", "cleanliness of IPS room. cracks/seepage/entry for rodents etc-yes xiv. Check SPD Box. Earthing to be intact and proper. Indications in SPDs to be checked. Non- Indicative type SPDs to be tested by SPD life tester. PF contacts of SPD (wherever provided) is wired in Data logger/RTU xv. Check for availability of well framed IPS load diagram in IPS room xvi. Check for working of INV to INV & INV to CVT changeover function xvii. Refer para E(i) for condition of battery room. Room is well ventilated with working condition of exhaust fans. xviii. Battery sets are clean without dust accumulation to avoid shorting of terminals & Earth faults. Its DOI/No of sets/AH capacity. xix. Check battery sustainability report maintained by staff. xx. Check IPS auditing report (To be done by SSE if not available). xxi. Check battery maintenance register (to be available in AMC register)-yes xxii. Battery connecting terminals are provided proper sized nut & bolts with petroleum jelly applied on it/Double", "lable). xxi. Check battery maintenance register (to be available in AMC register)-yes xxii. Battery connecting terminals are provided proper sized nut & bolts with petroleum jelly applied on it/Double lead wires for batteries provided-yes xxiii. Competency of staff. xxiv. All PF contacts are wired in Data logger. SMS alert feature is functional xxv. Requirement of spares & any other miscellaneous check -Not required. x.Insulated xi. Intact xii. working xiii. clean. xiv.Intact xv. Updated flex board required xvi. load is shifted xvii. well ventilated xviii. dust free. xix. maintained xx. Load audit not avl xxi. available xxii. nut bolt ok , petroleum jelly avl xxiii. ava ilable xxiv.yes xxv. Not required. TDC?? IPS Parameters: SMR OFF AC Input: 231.6 VAC /1.62A , DC Output: 108.7 V, 11.2 A(When SMR Off) Battery Set-1 Battery Set-2 Voltage Gravity Voltage Gravity 1. 1.97v 1200 1.99V 1220 2. 1.97v 1190 1.97V 1220 3. 1.96v 1190 1.97V 1220 4. 1.99v 1210 1.96V 1220 5 1.96v 1190 1.99V 1220", "A(When SMR Off) Battery Set-1 Battery Set-2 Voltage Gravity Voltage Gravity 1. 1.97v 1200 1.99V 1220 2. 1.97v 1190 1.97V 1220 3. 1.96v 1190 1.97V 1220 4. 1.99v 1210 1.96V 1220 5 1.96v 1190 1.99V 1220 SSE/S/RJN JE/SIG/RSM 6 2.00v 1210 1.98V 1240 7 2.00v 1200 1.99V 1240 8 1.96v 1190 2.00V 1240 9 1.97v 1210 1.97V 1220 10 1.99v 1210 1.97V 1220 11 1.99v 1200 1.97V 1220 12 1.98v 1180 1.97V 1220 13 1.98v 1200 1.98V 1220 14 1.98v 1200 1.99V 1240 15 1.99v 1200 1.99V 1240 16 1.98v 1220 1.98V 1240 17 1.98v 1210 2.00V 1240 18 1.98v 1210 2.00V 1250 19 1.98v 1190 1.99V 1240 20 1.97v 1190 1.97V 1220 21 1.99v 1200 1.96V 1220 22 1.96v 1210 1.97V 1220 23 1.99v 1200 1.98V 1200 24 1.97v 1200 1.97V 1220 25 1.99v 1200 1.99V 1230 26 1.98v 1190 1.96V 1220 27 1.99v 1200 1.96V 1200 28 1.98v 1210 1.96V 1200 29 1.98v 1200 1.97V 1200 30 1.97v 1190 1.98V 1210 31 1.97v 1200 1.95V 1210 32 1.97v 1210 1.97V 1210 33 1.97v 1200 1.99V 1220 34 1.97v 1200 1.97V 1230 35 1.97v 1180 1.97V 1220 36 1.97v 1210 1.97V 1220 37", "1.98v 1200 1.97V 1200 30 1.97v 1190 1.98V 1210 31 1.97v 1200 1.95V 1210 32 1.97v 1210 1.97V 1210 33 1.97v 1200 1.99V 1220 34 1.97v 1200 1.97V 1230 35 1.97v 1180 1.97V 1220 36 1.97v 1210 1.97V 1220 37 1.98v 1210 1.99V 1240 38 1.97v 1220 1.96V 1200 39 1.97v 1200 1.96V 1220 40 1.98v 1190 1.97V 1200 41 1.99v 1200 1.99V 1220 42 1.98v 1200 1.97V 1220 43 1.97v 1210 1.97V 1220 44 1.97v 1210 1.98V 1220 45 1.98v 1200 1.98V 1220 46 1.98v 1210 1.98V 1220 47 1.98v 1210 1.98V 1220 48 1.97v 1220 1.99V 1220 49 2.02v 1210 1.99V 1210 50 2.01v 1210 2.01V 1220 51 2.01v 1210 2.00V 1200 52 2.01v 1210 2.01V 1220 53 2.02v 1210 2.01V 1210 54 2.02v 1210 2.01V 1220 55 2.00v 1200 2.00V 1220 Total Batt . Vol. 108.5 V 108.4V Cables: 6.1 i. Check cable meggering register (It should be done as per periodicity/not in rainy or wet condition). Noted discrepancies/ action taken. ii. All terminations at CTRs, location boxes/JBs to be checked for sulphation/Entries of cables in Relay room, cable pit, Location box/JB to", "rainy or wet condition). Noted discrepancies/ action taken. ii. All terminations at CTRs, location boxes/JBs to be checked for sulphation/Entries of cables in Relay room, cable pit, Location box/JB to be checked & sealed. iii. Visual check of protective arrangements provided at track crossing/culverts/bridges/construction Site Condition i. Checked ok New readings yet to be filled. ii .Checked ok iii .checked SSE/S/DGG JE/SIG/RSM iv. Condition and fastening arrangements of pipes on bridges. -- v. Verification of cable route plan. vi. Record on cable cut cases by outsiders & executing agencies for last 1 year to be checked. vii. Record on signalling failures on account of cable low insulation cases for last 1 year to be checked. . viii. Check fault indications on ELD. ix. Requirement of spares & any other miscellaneous check iv. Ok v. ok vi. NIL vii. No viii. No ind ix. No 7. Signals: 7.1 i. Check for condition of Signal post/foundation/ladder. Alignment of Signal post to be proper. ii.", "res & any other miscellaneous check iv. Ok v. ok vi. NIL vii. No viii. No ind ix. No 7. Signals: 7.1 i. Check for condition of Signal post/foundation/ladder. Alignment of Signal post to be proper. ii. Check for condition of Signal units (door closing/locking arrangement/ no access for rain water/rodent entry/gaskets are provided.-3 iii. Clearance of signals from OHE wire to be checked iv. Painting of Signal post/unit/ladder/number plates is satisfactory. v. Integrated LED units are provided for all main aspects.- vi. Check for infringement of Signals w.r.t SOD. Implantations to be marked on signals on the side of the post facing the nearest track. In case of i. good ii.Checked ok iii. adequate iv. Not Satisfactory v. provided vi. SSE/S/DG JE/SIG/RSM infringement, implantation to be marked in Red.- vii. Check for arrow mark on RHS Signals.- viii. Check that Wooden Cross is provided on signals not in use. ix. Earthing of Signal post & unit to be intact without rust & looseness at earth", "d in Red.- vii. Check for arrow mark on RHS Signals.- viii. Check that Wooden Cross is provided on signals not in use. ix. Earthing of Signal post & unit to be intact without rust & looseness at earth wire connecting terminals. x. Check maintenance record for measured V/I range for signal aspects during schedule maintenance.- xi. Carry out sample check on V/I range of aspects. xii. Check record on LED defective cases for last 1 year. xiii. Check record on unsafe incidences related to malfunctioning of Signal aspects for last 1 year. xiv. Check condition of Signal locations. It is to be perpendicular to track. xv. Loc box handle & E-type lock are working properly. xvi. Lamp with switches should be provided in location boxes to facilitate rectification in case of exigencies at night. xvii. Relays in location boxes are fixed with spring washers & check nuts/holding clips are intact. xviii. Cable termination chart displayed on inner side of the door. xix. Contact paralleling done for", "vii. Relays in location boxes are fixed with spring washers & check nuts/holding clips are intact. xviii. Cable termination chart displayed on inner side of the door. xix. Contact paralleling done for Relays in location box (as per feasibility). xx. Neatness of wiring/Gauge of wires to be proper/single wire or cable core to be inserted in holes on hylum sheets for wiring. xxi. Condition of wooden plank (if provided).`Good xxii. Sand filling/Plastering at cable entry not damaged xxiii. Requirement of spares & any other miscellaneous check. vii. S10, S3 RHS Up loop line str, Up main line str, arrow avl. viii. NA ix. OK x. Done xi.done, ok xii. Nil xiii.Nil xiv. Yes xv. Yes xvi. Not provided xvii. intact xviii. yes xix. done xx.neat xxi.Good Xxii. OK xxiii.MSDAC,SPD required- 04nos. 7.2 Checked following signals and Measured parameters, found ok: SSE/S/DGG JE/SIG/RSM Signal No. Aspect Voltage (V) Current (A) S-1 HG 110.7 134mA S-2 RG 109.8 131ma S-3 RG 109.6 132mA S-4 RG 110.3 131mA S-5", "cked following signals and Measured parameters, found ok: SSE/S/DGG JE/SIG/RSM Signal No. Aspect Voltage (V) Current (A) S-1 HG 110.7 134mA S-2 RG 109.8 131ma S-3 RG 109.6 132mA S-4 RG 110.3 131mA S-5 HG 108.7 129MA S-6 RG 110.3 136mA S-7 RG 109.6 331mA S-10 RG 109.3 128mA S-11 DG 110.2 131mA S-13 DG 109.6 135mA S-22 RG 110.7 133mA S-27 RG 109.6 132mA S-28 HG 110.5 137.mA 8. Track Circuits: SSE/S/RJN JE/SIG/RSM Sr. Track No. Charg er Volt Char ger Amp Resist ance Feed Choke TF Volt Specific Gravity TR Cho ke TR Volt V Amp Ohm V V 1 2 3 Tota l Volt V V i. 37T 7.41 - .76 1.16 5.22 1210 1210 1210 6.46 1.17 4.90 ii. GLT1 7.32 - 1.17 5.36 1200 1200 1200 6.56 1.15 4.88 iii. GLT2 7.92 - 1.05 5.00 1210 1200 1200 6.29 0.99 4.75 iv. 34BT 7.40 - 1.01 4.64 1210 1200 1220 6.63 0.98 4.31 v. CLT1 7.27 - 1.05 5.21 1200 1210 1200 6.34 1.15 4.89 vi. CLT2 7.15 - 1.14 4.82 1210 1220 1210 6.30 0.98 4.64 vii. 27T 7.38 - 1.01 4.76 1200 1210 1200 6.45 1.00 4.36 viii 1AT 7.09 - 1.06 5.0 1200 1200 1210 6.54", "7 - 1.05 5.21 1200 1210 1200 6.34 1.15 4.89 vi. CLT2 7.15 - 1.14 4.82 1210 1220 1210 6.30 0.98 4.64 vii. 27T 7.38 - 1.01 4.76 1200 1210 1200 6.45 1.00 4.36 viii 1AT 7.09 - 1.06 5.0 1200 1200 1210 6.54 1.03 4.45 ix 1T 7.10 - 1.07 4.62 1210 1220 1210 6.45 0.97 4.53 x 31BT 7.34 - 1.06 5.25 1220 1220 1200 6.32 1.12 4.44 xi 2AT 7.23 - 1.03 5.21 1210 1200 1220 6.54 0.99 4.36 xii 2T 7.19 - 1.15 5.25 1200 1220 1200 6.43 0.94 4.56 8.1 i. Visual checking of condition of – Track lead JBs, track lead wires (double lead wires to be provided), S&T bonds( transverse/continuity/structural bonds), intactness of OHE bonds, insulation sleeves on OHE bonds beneath rail, relevant Glued Joints, level of ballast below rail, provision of GFN liners, J-clip at GJs, GJs not on sleepers, insulation of stretcher bars/Gauge tie plate/Point roddings (For track circuits on turnouts)etc. Discrepancies to be noted. ii. GJs are provided on crossing portion in clear of fouling marks. iii. Track relay is not due for", "bars/Gauge tie plate/Point roddings (For track circuits on turnouts)etc. Discrepancies to be noted. ii. GJs are provided on crossing portion in clear of fouling marks. iii. Track relay is not due for replacement. Check for dust on contacts/fungus/crack & breakage of components. iv. Check condition of Location box (Feed end/Relay end/battery location)- Refer G(xiv to xxii) v. Check condition of wooden planks. It should not be sagging due to load. vi. DOI is painted on Track batteries/ 80AH cells are provided. vii. Check all voltage/current parameters of track circuit/Choke voltage and compare with previous measurements. viii. Check ballast resistance. ix. Check recent cable insulation reports of tail cables (recheck if required) x. Check TSR at Relay end/Feed end/ at other parallel portion of track/Check track locking of Point zone track circuits. xi. No dead zone for more than 1.8m. xii. Check gripping of feed end fuse (4A). Provision of PPTC fuses. Adequate voltage level for TPR", "rtion of track/Check track locking of Point zone track circuits. xi. No dead zone for more than 1.8m. xii. Check gripping of feed end fuse (4A). Provision of PPTC fuses. Adequate voltage level for TPR circuit. xiii. Voltages at 1st TPRs in Relay room/Goomties for farthest end track circuits. xiv. Check for excitation of Track relay (not more than 300 i. provided ii. yes iii.yes iv. checked v. Good vi.yes vii.checked viii. check ix. check x.checked xi. ensured xii.check xiii.26.4 Below 300% Checked SSE/S/RJN JE/SIG/RSM % for QTA2 & 235% for QBAT). xv. Check specific gravity/votage of individual cells and compare with previous records. xvi. Check for effectiveness of wiring of PF contacts of Track chargers. xvii. Any other items & spare requirement. Checked 80AH cell 45 nos 9.Points: 9.1 i. Check previous Jt. Pt & Crossing inspection register. Discrepancies noted/progress on compliance/top sheet of register to contain discrepancies & compliance/miniature yard layout is available in", ".1 i. Check previous Jt. Pt & Crossing inspection register. Discrepancies noted/progress on compliance/top sheet of register to contain discrepancies & compliance/miniature yard layout is available in register.- yes, 25.08.23 ii. Check the layout (Squareness/ballast clearance (50 mm)/Opening at toe/ Housing /packing/ clearance at JOH(for TWS)/Condition of P-Way fittings)- ballast clearance not 50 mm on all points. iii. Fixing of point machine on sleepers to be proper without looseness/Clearance between sleepers 3&4 (685 mm- for Normal switches & 745 mm for TWS)-Proper iv. Clearance between top edge of stretcher and bottom of the stock rail (1.5 to 3mm)- For 143 mm Normal switches. v. Oiling of Point machine (Periodicity- half yearly) vi. Length of feeding to be within limit for RE area- Within limit vii. Check data in maintenance card for previous readings- checked viii. Check Condition of SSD on sleeper 13 &14- it should be of latest type with insulations on arm(For TWS) ix. Ground", "Within limit vii. Check data in maintenance card for previous readings- checked viii. Check Condition of SSD on sleeper 13 &14- it should be of latest type with insulations on arm(For TWS) ix. Ground connection rods are free from ballast. Visual checking of insulations on Point roddings. Painting of roddings. Clearance between point roddings x. Check operation by Crank handle. It should not be possible to insert crank handle without assigned key/ Crank handle assembly is clean with adequate contact pressure. I .Avl ii.Checked, ok iiChecked, ok iv. Within limit v. done vi. within limit vii.checked ok viii. SSD latest at point 33A, 43B, 42B ix. clear x. checked found ok SSE/S/D G G JE/SIG/ RSM xi. Measurement of operating values (Voltage & Current) of point machine with & without obstruction. Current on obstruction to be 1.5 to 2 times of normal value (Friction cutch to slip within this range).Difference between normal & *obstruction current (should not be less than 0.5A). Measured", "uction. Current on obstruction to be 1.5 to 2 times of normal value (Friction cutch to slip within this range).Difference between normal & *obstruction current (should not be less than 0.5A). Measured values to be compared with previous readings. Obstruction test to be done with 5mm/1.6mm test pieces kept at 150 mm from the toe. xii. Voltage drop at far end points - It should not be less than 75% of its rated voltage for standard thrust load of 450 Kg (Normal switch) & 550Kg (TWS) xiii. Smoothness of commutator & carbon brushes/Contact pressure xiv. Previous record on meggaring of Point cables.- xv. Record on failure of the point for last 1 year/causes/action taken. xvi. Any other items & spare requirement xi. values taken and checked xii. within range ] xiii. ok xiv. avl xv. taken xvi. Poin t JB required Sr. No. Point No. Working current (A) Obstructi on current (A) Working Voltage (V) Obstruction Voltage (V) Opening of T/Rail & S/Rail (MM) N/R R/N N/R R/N N/R R/N N/R R/N N/R R/N i.", "Poin t JB required Sr. No. Point No. Working current (A) Obstructi on current (A) Working Voltage (V) Obstruction Voltage (V) Opening of T/Rail & S/Rail (MM) N/R R/N N/R R/N N/R R/N N/R R/N N/R R/N i. 31A 1.8 1.9 3.8 4.3 103 104 100 98 110 112 ii. 31B 2.0 1.9 4.6 4.4 1.6 108 89 87 115 113 iii. 32A 1.9 2.0 3.7 4.0 1.9 107 98 96 167 162 iv. 32B 1.80 2.0 3.6 3.9 107 104 9.9 92 115 116 v. 33A 1.9 1.8 4.2 4.2 106 105 100 96 165 163 vi. 34A 1.9 1.7 3.7 3.9 110 109 102 101 110 112 vii. 34B 18 1.9 3.6 3.7 106 108 101 98 116 113 viii. 41A 2.0 1.7 3.9 3.8 107 108 99 96 112 114 ix. 41B 1.9 1.8 3.6 4.0 110 102 89 92 110 116 x. 41A 1.7 1.6 3.8 3.9 109 104 93 91 112 113 xi. 42B 1.9 1.7 3.9 3.9 106 105 99 91 115 116 xii. 37 1.8 1.8 4.1 4.0 109 107 100 99 115 113 10.Electric lifting barrier & Sliding barriers: 10.1 General: LC-454 km- 881/3-9 TVU- 53402 DEC 2021 1. Gate Man, Shri. Nitin, was on duty. He was in uniform and alert on duty. He had good knowledge about railway working. PME date –", "iding barriers: 10.1 General: LC-454 km- 881/3-9 TVU- 53402 DEC 2021 1. Gate Man, Shri. Nitin, was on duty. He was in uniform and alert on duty. He had good knowledge about railway working. PME date – 28.01.2021. Due- 27.01.2025 RC date – 12.05.2021 Due-11.05.2025 2. Safety equipment‟s according to the list were available and in good condition. – checked ok 3. GWR (both Hindi & English) was available. Protection diagram was available. OK 4. Visibility of road from Gate operating panel was good-OK 5. Condition of approach road was good ADEN/G SSE/S/RJN JE/SIG/RSM 10.2 Technical: 1. Condition of Gate operating panel was ok. All indications and buttons were intact.- OK 2. Alignment of Booms was proper. fully open (85 to 90 degree)/fully closed (0 to 5 degree).-OK 3. Gate stops in midway on releasing Gate close button.-- Yes 4. Checked working of RKTs for emergency operation & Sliding barriers and found working ok. 5. Indications for RKTs provided. 6. Boom locking checked and found ok. 7.", "eleasing Gate close button.-- Yes 4. Checked working of RKTs for emergency operation & Sliding barriers and found working ok. 5. Indications for RKTs provided. 6. Boom locking checked and found ok. 7. Sliding boom was easy to operate and travels smoothly in channel. 8. Retro reflective strips were provided on boom. 9. Pedestal, lock post & Gate Operating panel were earthed. 10. Pedestal of ELB to be connected to Rail earth. 11. Only AC immunized Relays are provided. SSE/S/DGG JE/SIG/RS M 11. Miscellaneous Electrical/Electronic Equipment’s: 11.1 Datalogger: 1. Data loggers were provided are of adequate capacity at center, east goomty and west goomty and provided at LC-454 auto Goomty. 2. Proper cleaning of instrument was there and dust accumulation absent. 3. All PCB cards were inserted properly. 4. Power Supply to Datalogger was provided through Charger- Battery system. 5. FAS (Fault analysis System) was connected to D/L and working. 6. Check LED position of both side modems and found", "operly. 4. Power Supply to Datalogger was provided through Charger- Battery system. 5. FAS (Fault analysis System) was connected to D/L and working. 6. Check LED position of both side modems and found ok. 7. All cable terminations (Analog & Digital input) were tightly connected. 8. Checked that NMDL software & all utility program (Reports/Simulation) running smoothly at FAS. Yard layout was accurate & updated. 9. Sample check on functioning of SMS alert was checked and found ok. SSE/S/RJN JE/SIG/RSM 11.2 MSDAC: a. Outdoor: 1. Track side Sensor (Tx/Rx coils) were found tightened properly. 2. Distance between two adjacent axle detectors of different axle counters was found more than 2 mtr. 3. Sensor cables, protective ducts including earthing connection were proper. 4. Tightness of deflector plates was checked and found ok. 5. Track side equipment box at locations was fixed properly on mushroom base plate. 6. Condition of earth rod, earth pit, continuity of connection was checked and", "ctor plates was checked and found ok. 5. Track side equipment box at locations was fixed properly on mushroom base plate. 6. Condition of earth rod, earth pit, continuity of connection was checked and found ok. SSE/S/RJN JE/SIG/RSM 7. In- built trolley suppression is available. b. Indoor: 1. All cable terminations were tight & properly connected in Relay room. 2. All fuses provided in Relay room/Evaluator PCBs were of proper capacity & tightened. 3. Redundancy available and redundant systems were powered through separate sources & cables. 4. Checked that the armour of Quad cable connecting DP location to Relay room was properly earthed & tightened. 5. All cards, PCBs & connectors were properly connected in Evaluators/ECs and free from dust. 6. Functioning of Reset indication and Counter was ok. 7. Checked quad cable maintenance record by SSE/Tele/DGG. Quad cable insulation was all pair between MUP-DGG are below 10M ohms and Loop resistance was not found . c. Miscellaneous: 1.", "Counter was ok. 7. Checked quad cable maintenance record by SSE/Tele/DGG. Quad cable insulation was all pair between MUP-DGG are below 10M ohms and Loop resistance was not found . c. Miscellaneous: 1. Maintenance record with JE/Sig/DGG was ok. 2. Parameters of all MSDAC were found to be with in limit as per OEM log sheet. 3. Proper procedures were being followed for resetting failed track section in Automatic territory MUP-RSM Auto section at MUP and following parameters were noted. SSE/S/RJN JE/SIG/RSM PARAMETE RS REFERENCE VALUE ACTUAL VALUE DP UAA25 DP UAA25 UAA25 30-72v 63.80V 63.58V U24 21.0-22.4V 21.91V 21.92V FS 42-43.2 KHZ 43.11KHZ 43.08KHZ F1 3.4-3.53 3.51KHZ 3.50KHZ KHZ F2 6.31-6.43 KHZ 6.40KHZ 6.40KHZ UR1 3.25-3.65V 3.41V 3.49V UR2 3.05-3.45V 3.20V 3.18V UE1 60-150mV 66.90mV 72.25mV UE2 60-150mV 66.40mV 70.05mV UL 0.48-1.80V 1.39V 1.38V Negativ e Earth Available Available 11.3 Earth Leakage Detector: 1. ELD is installed in IPS room & wired in Datalogger. 2. Bus bar name", "V 72.25mV UE2 60-150mV 66.40mV 70.05mV UL 0.48-1.80V 1.39V 1.38V Negativ e Earth Available Available 11.3 Earth Leakage Detector: 1. ELD is installed in IPS room & wired in Datalogger. 2. Bus bar name stickers on channel modules were available. 3. ELD equipment was free from dust and Bus bar indications was available on channel modules. 4. Checked earth connections to ELD through E1 & E2 to be at different points. continuity of earth connecting wires was proper. 5. Normal LED was glowing on channels. 6. if fault LED was glowing, corrective action to be taken.  ELD module may be defective.  Power supply to ELD not available.  There is heavy leakage in connected supply busbar. 7. Channels not in use were switched off. 1.Yes 2.Not 3.Yes 4.Yes 5.Yes 6.Inermittend 7.Yes SSSE/S/RJN JE/SIG/RSM 11.4 Fuse auto Changeover System: 1. FACS were provided in all Auto-cum gate Goomties. 2. FACS module was neatly fixed on the rack without accumulation of dust over it. 3. All cards & G-type fuses", "RSM 11.4 Fuse auto Changeover System: 1. FACS were provided in all Auto-cum gate Goomties. 2. FACS module was neatly fixed on the rack without accumulation of dust over it. 3. All cards & G-type fuses were properly inserted. 4. „Power on‟ LED indication was lit on Power card. 5. Checked condition of all LEDs by pressing test button on Power card. 6. Checked Reset push button on cards and buzzer reset push button on power card by simulating fuse blown up case 7. All wiring from relay racks to FACS is soldered directly to cards and mother board PCB. 1.Yes only in auto goomty 2. Yes 3.Yes 4.Yes 5.Yes 6.Yes 7.Yes 12. Telecom: 12.1 OFC hut: 1. Checked various maintenance registers maintained in OFC hut and found well maintained:  Battery Testing Register- Available  6 Quad Cable Testing Register (Continuity test, Attenuation Test, Insulation, Cross Talk)- not found.  Earth testing Register- Yes avl  Emergency Socket Testing Register – Yes avl  Station Maintenance register-Not", "ting Register (Continuity test, Attenuation Test, Insulation, Cross Talk)- not found.  Earth testing Register- Yes avl  Emergency Socket Testing Register – Yes avl  Station Maintenance register-Not Available  OFC Equipment Maintenance register-NOT Available 2. Cleanliness of OFC Hut and their Equipment‟s was proper- yes 3. Battery bank checked and found parameters within limit. (SPG Range- 1180 to 1220 /Cell voltages range-1.98 to 2.2V). yes 4. Battery Backup Test register was checked and found ok. 5. Battery connecting Terminal were provided with proper sized nut and bolts with petroleum jelly applied on it. 6. Battery sets are to be clean without dust accumulation to avoid shorting of terminals and Earth faults. 7. Date of Installation and Number of Sets and AH Capacity was mentioned in OFC Room. 8. Proper wiring and lacing of Cables inside the room was available. 9. DOI of OFC equipment to be mentioned in OFC Room. 10. Entry for rodents inside OFC room was sealed properly. 11.", "ed in OFC Room. 8. Proper wiring and lacing of Cables inside the room was available. 9. DOI of OFC equipment to be mentioned in OFC Room. 10. Entry for rodents inside OFC room was sealed properly. 11. Exhaust fans were in working condition. SSE/Tele/RJ N 12.2 SM’s Room: 1. All Control and Standby Telephones were checked and found working properly. Wiring of Telephones between Way Side Station Equipment to SM Panel were dressed properly 2. Hot Line Telephones were checked and found ok. 3. Driver Guard Communication with SM was checked in 25 W VHF set. 4. LC Gate Telephone and Standby telephones sets was tested with respective adjacent LC Gates connected DOM/NGP SSE/Tele/G/E with Stations. 12.3 Passenger Amenities at Station: Manual PA system only 1. Passenger Amenities daily checking register is available. 2. No Passenger Amenity system to be out of order for more than two hrs plus travel time of maintenance staff- yes  UTS/Booking Office: working well i. Cleanliness of Datacom", "g register is available. 2. No Passenger Amenity system to be out of order for more than two hrs plus travel time of maintenance staff- yes  UTS/Booking Office: working well i. Cleanliness of Datacom Equipments was checked and found ok. ii. Upkeep of Routers, Switch, Modems and UP was proper. iii. No Cracks/Seepage /entry for rodents was available.  Wi-Fi: ok i. Working of Wi -Fi installed at Station premises was monitored by connecting with mobile set and found working ok. SSE/Tele/RJN 12.4 Emergency Sockets: working satisfactorily 1. Testing of Emergency Control communication was done and found working ok. 2. To be checked Monthly by Supervisor Level and Twice a month in Technician Level. 3. Emergency Sockets Mast were painted and direction of nearest (Telephone Indication/Marker) for Emergency socket on OHE Masts was available. SSE/Tele/RJN 12.5 LC Gate connected with Stations. 1. Ring and Speech was checked and found ok. 2. Proper wiring and lacing of Cables inside the room was", "r Emergency socket on OHE Masts was available. SSE/Tele/RJN 12.5 LC Gate connected with Stations. 1. Ring and Speech was checked and found ok. 2. Proper wiring and lacing of Cables inside the room was available. SSE/Tele/R JN Counseling & staff grievances: 13.1 Counselling Staff on following lines was done –  Safety norms to be adhered to during rectification of failures & day to day maintenance activity.  Requirement of disconnection for various activities.  Personal safety when on & around the track.  Not to use mobile, ear phones when working on track.  Attending night failures jackets laminated must.  JPOs on joint works with Engg for Point & track renewal/machine packing works.  Fire safety.  Procedures to be followed during non-signled movement of trains in the yard.  Any other issues to be discussed- advised to be stress free. SSE/S/RJN JE/SIG/RS M 13.2 Grievances of staff to be noted for redress: Only one staff (Yogesh)Quarter is available at MUP, 3 more", "ard.  Any other issues to be discussed- advised to be stress free. SSE/S/RJN JE/SIG/RS M 13.2 Grievances of staff to be noted for redress: Only one staff (Yogesh)Quarter is available at MUP, 3 more quarters type II, required. ADEN/DG G Copy to – i. P.S. to Sr. DSTE/NGP for kind information please. ii. DOM/NGP for kind information please. iii. ARM/G for kind information. iv. ADEN/G for kind information and necessary action please. v. ADEE/G/G for kind information and necessary action please. vi. SSE/S/DgG, SSE/Tele/RJN/, JE/S/RSM", "Sanjeev Kumar Noida, India | +91 7289909687 | sksanjeevkumar489@gmail.com | linkedin.com/in/sanjeev- k-6b2490b9 OBJECTIVE GeneraGve AI Engineer with 6.5 years of experience designing, developing, and deploying scalable AI soluGons on cloud-naGve plaRorms including Azure, AWS, and Google Cloud. Proven experGse in LLM-powered applicaGons, prompt engineering, AgenGc AI, and cloud infrastructure automaGon. Seeking to deliver innovaGve GenAI soluGons blending cuYng-edge AI research with producGon-grade cloud scalability. SKILLS • GeneraGve AI & ML: Python, Prompt Engineering, LLMs (GPT-3.5, GPT-4, LLaMA), LangChain, AgenGc AI, LangGraph, RAG, OpenAI API, Microsoc Copilot Studio • Cloud PlaRorms: Azure (OpenAI, FuncGons, CogniGve Services, Copilot Studio), AWS, Google Cloud (Vertex AI) • Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy", "Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy Services (TCS) — Jan 2025 – Present | Noida, India • Designed and deployed enterprise GenAI chatbots and workﬂow automaGon soluGons leveraging Python, OpenAI GPT-4, LangChain, and MicrosoD Copilot Studio. • Implemented agenGc AI automaGon workﬂows, integraGng Microsoc Copilot Studio for rapid agent development and orchestraGon. • Architected cloud-naGve AI deployments on Azure and Google Cloud (Vertex AI) to maximize scalability, fault tolerance, and performance. • Applied advanced prompt engineering methodologies (zero/one/few-shot, RAG) to improve user experience and system accuracy. • Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and", "• Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and chatbots using OpenAI, LangChain, and Google Vertex AI, improving customer interacGon automaGon. • Automated cloud infrastructure provisioning using Terraform for scalable GenAI services on Azure and Google Cloud. • Led AI pipeline CI/CD incorporaGng model training, tesGng, and deployment. • Pioneered adopGon of MicrosoD Copilot Studio for enterprise agent prototypes and AI service integraGon. GeneraGve AI Engineer Infosys — Dec 2021 – Jan 2024 • Built producGon-grade GenAI assistants uGlizing LangGraph and Azure cloud AI services. • Integrated various cloud databases and vector search engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 •", "h engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 • Automated cloud provisioning and container orchestraGon pipelines, supporGng AI data workloads. GENAI PROJECT HIGHLIGHTS • Delivered highly scalable, producGon-level GenAI chatbots with GPT and LangChain, opGmized through advanced prompt engineering. • Led automaGon and integraGon of large-scale AI workﬂows using Microsoc Copilot Studio and Google Vertex AI. • Implemented seamless AI applicaGon deployment using Terraform on mulG-cloud environments. • Developed robust vector search systems integraGng Pinecone, CosmosDB, and relaGonal databases for AI applicaGons. CERTIFICATIONS & BADGES • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon", "S • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon Engineering Dr. A.P .J. Abdul Kalam Technical University (2015–2019)", "Sanjeev Kumar Noida, India | +91 7289909687 | sksanjeevkumar489@gmail.com | linkedin.com/in/sanjeev- k-6b2490b9 OBJECTIVE GeneraGve AI Engineer with 6.5 years of experience designing, developing, and deploying scalable AI soluGons on cloud-naGve plaRorms including Azure, AWS, and Google Cloud. Proven experGse in LLM-powered applicaGons, prompt engineering, AgenGc AI, and cloud infrastructure automaGon. Seeking to deliver innovaGve GenAI soluGons blending cuYng-edge AI research with producGon-grade cloud scalability. SKILLS • GeneraGve AI & ML: Python, Prompt Engineering, LLMs (GPT-3.5, GPT-4, LLaMA), LangChain, AgenGc AI, LangGraph, RAG, OpenAI API, Microsoc Copilot Studio • Cloud PlaRorms: Azure (OpenAI, FuncGons, CogniGve Services, Copilot Studio), AWS, Google Cloud (Vertex AI) • Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy", "Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy Services (TCS) — Jan 2025 – Present | Noida, India • Designed and deployed enterprise GenAI chatbots and workﬂow automaGon soluGons leveraging Python, OpenAI GPT-4, LangChain, and MicrosoD Copilot Studio. • Implemented agenGc AI automaGon workﬂows, integraGng Microsoc Copilot Studio for rapid agent development and orchestraGon. • Architected cloud-naGve AI deployments on Azure and Google Cloud (Vertex AI) to maximize scalability, fault tolerance, and performance. • Applied advanced prompt engineering methodologies (zero/one/few-shot, RAG) to improve user experience and system accuracy. • Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and", "• Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and chatbots using OpenAI, LangChain, and Google Vertex AI, improving customer interacGon automaGon. • Automated cloud infrastructure provisioning using Terraform for scalable GenAI services on Azure and Google Cloud. • Led AI pipeline CI/CD incorporaGng model training, tesGng, and deployment. • Pioneered adopGon of MicrosoD Copilot Studio for enterprise agent prototypes and AI service integraGon. GeneraGve AI Engineer Infosys — Dec 2021 – Jan 2024 • Built producGon-grade GenAI assistants uGlizing LangGraph and Azure cloud AI services. • Integrated various cloud databases and vector search engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 •", "h engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 • Automated cloud provisioning and container orchestraGon pipelines, supporGng AI data workloads. GENAI PROJECT HIGHLIGHTS • Delivered highly scalable, producGon-level GenAI chatbots with GPT and LangChain, opGmized through advanced prompt engineering. • Led automaGon and integraGon of large-scale AI workﬂows using Microsoc Copilot Studio and Google Vertex AI. • Implemented seamless AI applicaGon deployment using Terraform on mulG-cloud environments. • Developed robust vector search systems integraGng Pinecone, CosmosDB, and relaGonal databases for AI applicaGons. CERTIFICATIONS & BADGES • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon", "S • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon Engineering Dr. A.P .J. Abdul Kalam Technical University (2015–2019)", "PANKAJ SHARMA Joint Holder :- - 182/1 MOUNT ROAD RAILWAY OFFICERS COLONY NAGPUR (URBAN) VCA GROUND NAGPUR Customer ID :837537760 MAHARASHTRA-INDIA IFSC Code :UTIB0000015 440001 MICR Code :110211003 Nominee Registered : Y Registered Mobile No :XXXXXX5581 Registered Email ID:MAXXXX07@GMAIL.COM PAN :CUEPS7726R Scheme :PRESTIGE SALARY ACCOUNT CKYC NUMBER :XXXXXXXXXX6314 Statement of Axis Account No :911010003705120 for the period (From : 05-10-2025 To : 04-11-2025) Tran Date Chq No Particulars Debit Credit Balance Init. Br OPENING BALANCE 1800.00 05-10-2025 UPI/P2A/527820646230/ANKITA UP/AXIS BANK/NA/ 3000.00 4800.00015 06-10-2025 NBSM/121793933/WHIZDM INNOVATIONS PVT LTD/ 22325.00 -17525.00015 06-10-2025 Sweep Trf From: 924030011524478 17525.00 .00015 13-10-2025 UPI/P2M/293265040080/Jio /Sent u/YES BANK LIMITED YBS 39.00 -39.00015 13-10-2025 Sweep Trf From: 924030011524478 39.00 .00015 14-10-2025 UPI/P2A/528772502333/ANKITA UP/AXIS BANK/NA/ 1800.00 1800.00015 14-10-2025", "265040080/Jio /Sent u/YES BANK LIMITED YBS 39.00 -39.00015 13-10-2025 Sweep Trf From: 924030011524478 39.00 .00015 14-10-2025 UPI/P2A/528772502333/ANKITA UP/AXIS BANK/NA/ 1800.00 1800.00015 14-10-2025 UPI/P2M/293309827910/Jio /Sent u/YES BANK LIMITED YBS 300.80 1499.20015 19-10-2025 UPI/P2M/390997030038/MAHOBE MEDICAL STORE /Sent u/YES BANK LIMITED YBS 290.00 1209.20015 26-10-2025 UPI/P2M/566500364932/ZEE5/YES BANK /Subscrip//P2V/ 199.00 1010.20015 26-10-2025 UPI/P2M/212757754523/SHRI RAM MEDICAL STOR/NO REM/YES BANK LIMITED YBS 30.00 980.20015 26-10-2025 UPI/P2A/101798883360/NPCI BHIM/HDFC BANK/BHIMCASH/ 3.00 983.20015 27-10-2025 NBSM/123679362/APPLE SERVICES(BILLDESK)/ 200.00 783.20015 27-10-2025 NBSM/123679594/APPLE SERVICES(BILLDESK)/ 200.00 583.20015 30-10-2025 ECS Txn Chrgs Incl GST 29.50 553.70015 30-10-2025 RC Int Bounce Chrg Incl GST 564.67 -10.97015 30-10-2025 Sweep Trf From: 924030011524478 10.97 .00015 31-10-2025 NEFT/SBIN225304659681/Salary of Oct 2025/STATE BANK OF", "cl GST 29.50 553.70015 30-10-2025 RC Int Bounce Chrg Incl GST 564.67 -10.97015 30-10-2025 Sweep Trf From: 924030011524478 10.97 .00015 31-10-2025 NEFT/SBIN225304659681/Salary of Oct 2025/STATE BANK OF INDIA//ATTN//INB 122260.00 122260.00248 31-10-2025 MOB/SELFFT/924030011524478/924030011524 478 80000.00 42260.00015 31-10-2025 CreditCard Payment XX 5827 Ref#44RR0FTTOQKEMX 17735.47 24524.53015 31-10-2025 IMPS/P2A/530484067945/PankajSharma/X83633 5/KOTAKMAHINDRABANKLTD 5000.00 19524.53015 01-11-2025 Bill Collection for Revolving OD a/c 6916.00 12608.53245 01-11-2025 UPI/P2A/693154129572/Delhi Public School /Sent u/HDFC BANK LTD 13200.00 -591.47015 01-11-2025 Sweep Trf From: 924030011524478 612.94 21.47015 01-11-2025 MOB/TPFT/ANKITA UPADHYAY/914010029664769 65000.00 -64978.53015 01-11-2025 Sweep Trf From: 924030011524478 65000.00 21.47015 Legends : ICONN - Transaction trough Internet Banking VMT-ICON - Visa Money Transfer through Internet Banking AUTOSWEEP - Transfer to linked fixed", "025 Sweep Trf From: 924030011524478 65000.00 21.47015 Legends : ICONN - Transaction trough Internet Banking VMT-ICON - Visa Money Transfer through Internet Banking AUTOSWEEP - Transfer to linked fixed deposit REV SWEEP - Interest on Linked fixed Deposit SWEEP TRF - Transfer from Linked Fixed Deposit / Account VMT - Visa Money Transfer through ATM CWDR - Cash Withdrawal through ATM PUR - POS purchase TIP/ SCG - Surcharge on usage of debit card at pumps/railway ticket purchase or hotel tips RATE.DIFF - Difference in rates on usage of card internationally CLG - Cheque Clearing Transaction EDC - Credit transaction through EDC Machine SETU - Seamless electronic fund transfer through AXIS Bank Int.pd - Interest paid to customer Int.Coll - Interest collected from the customer This is a system generated output and requires no signature. 02-11-2025 UPI/P2M/391647217401/MR AND MRS BARBER /Sent u/KARNATAKA BANK LTD 750.00 -728.53015 02-11-2025 UPI/P2M/391647552006/FL LINKROAD 2348 /Sent u/SBI", "generated output and requires no signature. 02-11-2025 UPI/P2M/391647217401/MR AND MRS BARBER /Sent u/KARNATAKA BANK LTD 750.00 -728.53015 02-11-2025 UPI/P2M/391647552006/FL LINKROAD 2348 /Sent u/SBI PAYMENT SERVICES 2000.00 -2728.53015 02-11-2025 UPI/P2M/391648326330/Smart Bilaspur TKX6 /Sent u/JIO PAYMENTS BANK LT 231.50 -2960.03015 02-11-2025 Sweep Trf From: 924030011524478 2981.50 21.47015 TRANSACTION TOTAL 215010.94 213232.41 CLOSING BALANCE 21.47 Unless the constituent notifies the bank immediately of any discrepancy found by him/her in this statement of Account, it will be taken that he/she has found the account correct. The closing balance as shown/displayed includes not only the credit balance and / or overdraft limit, but also funds which are under clearing. It excludes the amount marked as lien, if any. Hence the closing balance displayed may not be the effective available balance. For any further clarifications, please contact the Branch. We would like to reiterate that,", "ount marked as lien, if any. Hence the closing balance displayed may not be the effective available balance. For any further clarifications, please contact the Branch. We would like to reiterate that, as a policy, Axis Bank never asks you to share, disclose, or revalidate your login Id, password or debit card number number through emails OR phone call Further,we would like to reiterate that Axis Bank shall not be liable for any losses arising from you sharing/disclosing of your login id, password and debit card number to anyone. Please co-operate by forwarding all such suspicious/spam emails, if received by you, to customer.service@axisbank.com With effect from 1st August 2016, the replacement charges for Debit card and ATM card applicable on Current accounts have been revised. To know more about the applicable charges,please visit www.axisbank.com Deposit Insurance and Credit Guarantee Corporation (DICGC) insurance cover is applicable in all Banks' deposits, such as savings, current,", "re about the applicable charges,please visit www.axisbank.com Deposit Insurance and Credit Guarantee Corporation (DICGC) insurance cover is applicable in all Banks' deposits, such as savings, current, fixed, recurring etc* up to maximum amount of Rs 5 Lakh including principal & interest both* (* or exceptions and details please refer www.dicgc.org.in ) In compliance with regulatory guidelines, the non-CTS cheque books attached to the accounts would be destroyed in banks core banking System. Thus, Non CTS cheques will not be valid for CASH, Clearing and Transfer transactions To ensure you never miss any critical communication from us, it is important that your latest / correct mobile number and email ID are updated in our records. Kindly visit your nearest Axis Bank Loan Centre /Branch / Agri area office for updating your latest / correct mobile number and email ID in our records. You can also update your email ID using Internet Banking & Mobile Banking App, open REGISTERED OFFICE -", "/ Agri area office for updating your latest / correct mobile number and email ID in our records. You can also update your email ID using Internet Banking & Mobile Banking App, open REGISTERED OFFICE - AXIS BANK LTD,TRISHUL,Opp. Samartheswar Temple, Near Law Garden, Ellisbridge, Ahmedabad . 380006. BRANCH ADDRESS - AXIS BANK LTD, GREEN PARK, NEW DELHI [DL], K-12 GREEN PARK MAIN, NEW DELHI, , 110016, NEW DELHI, DELHI, INDIA, TEL:9582800152 FAX:26522334 ++++ End of Statement ++++ Request From: 10.9.71.13", "AI Engineer - Data and AI Chennai, Bangalore, Hyderabad JOB DESCRIPTION AI Engineer – Data and AI Location: Chennai, Bengaluru and Hyderabad Who we are? Tiger Analytics is a global leader in AI and analytics, helping Fortune 1000 companies solve their toughest challenges. We offer full- stack AI and analytics services & solutions to empower businesses to achieve real outcomes and value at scale. We are on a mission to push the boundaries of what AI and analytics can do to help enterprises navigate uncertainty and move forward decisively. Our purpose is to provide certainty to shape a better tomorrow. Our team of 4000+ technologists and consultants are based in the US, Canada, the UK, India, Singapore and Australia, working closely with clients across CPG, Retail, Insurance, BFS, Manufacturing, Life Sciences, and Healthcare. Many of our team leaders rank in Top 10 and 40 Under 40 lists, exemplifying our dedication to innovation and excellence. We are a Great Place to Work-Certified™", "cturing, Life Sciences, and Healthcare. Many of our team leaders rank in Top 10 and 40 Under 40 lists, exemplifying our dedication to innovation and excellence. We are a Great Place to Work-Certified™ (2022-24), recognized by analyst firms such as Forrester, Gartner, HFS, Everest, ISG and others. We have been ranked among the ʻBestʼ and ʻFastest Growingʼ analytics firms lists by Inc., Financial Times, Economic Times and Analytics India Magazine. Curious about the role? What your typical day would look like? Weʼre looking for a talented and driven AI Engineer to join a meaningful internal strategic initiative and also to contribute to solving complex AI/ML problems for our clients. You'll be working closely with senior leadership, including one of our founders, to help build an innovative enterprise platform for the organization. This platform will act as a digital twin of our existing systems—an intelligent bot/ Platform that provides real-time insights on what needs to be done and", "ve enterprise platform for the organization. This platform will act as a digital twin of our existing systems—an intelligent bot/ Platform that provides real-time insights on what needs to be done and how to do it. If you're passionate about Generative AI, LLMs, and cutting-edge technology, and you enjoy building high-impact solutions, weʼd love to hear from you! As an AI Engineer on the Data and AI team, you will: • Collaborate with leadership to understand the vision, scope, and requirements for the enterprise platform. • Help design and develop a smart, AI-driven platform that guides and optimizes projects with real-time intelligence. • Work hands-on with the latest technologies like LLMs (Large Language Models) and Generative AI to build transformative tools. • Assist in the integration of the platform with existing organizational systems, ensuring seamless functionality. • Contribute to building scalable, reliable, and high-performance software solutions. Participate in peer", "gration of the platform with existing organizational systems, ensuring seamless functionality. • Contribute to building scalable, reliable, and high-performance software solutions. Participate in peer reviews and champion code quality within the team. EXPERTISE AND QUALIFICATIONS What do we expect? • 2-6 years of experience in MLE/MLOps/AI Engg. • Experience working in LLMs, Generative AI, or similar AI technologies. • Proficient in backend development using Python (Django/Flask) or similar technologies. • Good understanding of APIs and microservices architecture. • Ability to collaborate with cross-functional teams and work in a fast-paced environment. • Passion for learning and applying new technologies to solve complex problems. You are important to us, letʼs stay connected! Every individual comes with a different set of skills and qualities so even if you donʼt tick all the boxes for the role today, we urge you to apply as there might be a suitable/unique role for you tomorrow. We", "vidual comes with a different set of skills and qualities so even if you donʼt tick all the boxes for the role today, we urge you to apply as there might be a suitable/unique role for you tomorrow. We are an equal opportunity employer. Our diverse and inclusive culture and values guide us to listen, trust, respect, and encourage people to grow the way they desire. Note: The designation will be commensurate with expertise and experience. Compensation packages are among the best in the industry. Additional Benefits: Health insurance (self & family), virtual wellness platform, and knowledge communities.", "Sanjeev Kumar Noida, India | +91 7289909687 | sksanjeevkumar489@gmail.com | linkedin.com/in/sanjeev- k-6b2490b9 OBJECTIVE GeneraGve AI Engineer with 6.5 years of experience designing, developing, and deploying scalable AI soluGons on cloud-naGve plaRorms including Azure, AWS, and Google Cloud. Proven experGse in LLM-powered applicaGons, prompt engineering, AgenGc AI, and cloud infrastructure automaGon. Seeking to deliver innovaGve GenAI soluGons blending cuYng-edge AI research with producGon-grade cloud scalability. SKILLS • GeneraGve AI & ML: Python, Prompt Engineering, LLMs (GPT-3.5, GPT-4, LLaMA), LangChain, AgenGc AI, LangGraph, RAG, OpenAI API, Microsoc Copilot Studio • Cloud PlaRorms: Azure (OpenAI, FuncGons, CogniGve Services, Copilot Studio), AWS, Google Cloud (Vertex AI) • Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy", "Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy Services (TCS) — Jan 2025 – Present | Noida, India • Designed and deployed enterprise GenAI chatbots and workﬂow automaGon soluGons leveraging Python, OpenAI GPT-4, LangChain, and MicrosoD Copilot Studio. • Implemented agenGc AI automaGon workﬂows, integraGng Microsoc Copilot Studio for rapid agent development and orchestraGon. • Architected cloud-naGve AI deployments on Azure and Google Cloud (Vertex AI) to maximize scalability, fault tolerance, and performance. • Applied advanced prompt engineering methodologies (zero/one/few-shot, RAG) to improve user experience and system accuracy. • Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and", "• Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and chatbots using OpenAI, LangChain, and Google Vertex AI, improving customer interacGon automaGon. • Automated cloud infrastructure provisioning using Terraform for scalable GenAI services on Azure and Google Cloud. • Led AI pipeline CI/CD incorporaGng model training, tesGng, and deployment. • Pioneered adopGon of MicrosoD Copilot Studio for enterprise agent prototypes and AI service integraGon. GeneraGve AI Engineer Infosys — Dec 2021 – Jan 2024 • Built producGon-grade GenAI assistants uGlizing LangGraph and Azure cloud AI services. • Integrated various cloud databases and vector search engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 •", "h engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 • Automated cloud provisioning and container orchestraGon pipelines, supporGng AI data workloads. GENAI PROJECT HIGHLIGHTS • Delivered highly scalable, producGon-level GenAI chatbots with GPT and LangChain, opGmized through advanced prompt engineering. • Led automaGon and integraGon of large-scale AI workﬂows using Microsoc Copilot Studio and Google Vertex AI. • Implemented seamless AI applicaGon deployment using Terraform on mulG-cloud environments. • Developed robust vector search systems integraGng Pinecone, CosmosDB, and relaGonal databases for AI applicaGons. CERTIFICATIONS & BADGES • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon", "S • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon Engineering Dr. A.P .J. Abdul Kalam Technical University (2015–2019)", "Sanjeev Kumar Noida, India | +91 7289909687 | sksanjeevkumar489@gmail.com | linkedin.com/in/sanjeev- k-6b2490b9 OBJECTIVE GeneraGve AI Engineer with 6.5 years of experience designing, developing, and deploying scalable AI soluGons on cloud-naGve plaRorms including Azure, AWS, and Google Cloud. Proven experGse in LLM-powered applicaGons, prompt engineering, AgenGc AI, and cloud infrastructure automaGon. Seeking to deliver innovaGve GenAI soluGons blending cuYng-edge AI research with producGon-grade cloud scalability. SKILLS • GeneraGve AI & ML: Python, Prompt Engineering, LLMs (GPT-3.5, GPT-4, LLaMA), LangChain, AgenGc AI, LangGraph, RAG, OpenAI API, Microsoc Copilot Studio • Cloud PlaRorms: Azure (OpenAI, FuncGons, CogniGve Services, Copilot Studio), AWS, Google Cloud (Vertex AI) • Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy", "Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy Services (TCS) — Jan 2025 – Present | Noida, India • Designed and deployed enterprise GenAI chatbots and workﬂow automaGon soluGons leveraging Python, OpenAI GPT-4, LangChain, and MicrosoD Copilot Studio. • Implemented agenGc AI automaGon workﬂows, integraGng Microsoc Copilot Studio for rapid agent development and orchestraGon. • Architected cloud-naGve AI deployments on Azure and Google Cloud (Vertex AI) to maximize scalability, fault tolerance, and performance. • Applied advanced prompt engineering methodologies (zero/one/few-shot, RAG) to improve user experience and system accuracy. • Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and", "• Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and chatbots using OpenAI, LangChain, and Google Vertex AI, improving customer interacGon automaGon. • Automated cloud infrastructure provisioning using Terraform for scalable GenAI services on Azure and Google Cloud. • Led AI pipeline CI/CD incorporaGng model training, tesGng, and deployment. • Pioneered adopGon of MicrosoD Copilot Studio for enterprise agent prototypes and AI service integraGon. GeneraGve AI Engineer Infosys — Dec 2021 – Jan 2024 • Built producGon-grade GenAI assistants uGlizing LangGraph and Azure cloud AI services. • Integrated various cloud databases and vector search engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 •", "h engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 • Automated cloud provisioning and container orchestraGon pipelines, supporGng AI data workloads. GENAI PROJECT HIGHLIGHTS • Delivered highly scalable, producGon-level GenAI chatbots with GPT and LangChain, opGmized through advanced prompt engineering. • Led automaGon and integraGon of large-scale AI workﬂows using Microsoc Copilot Studio and Google Vertex AI. • Implemented seamless AI applicaGon deployment using Terraform on mulG-cloud environments. • Developed robust vector search systems integraGng Pinecone, CosmosDB, and relaGonal databases for AI applicaGons. CERTIFICATIONS & BADGES • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon", "S • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon Engineering Dr. A.P .J. Abdul Kalam Technical University (2015–2019)", "Syam Kumar Mandapati Hyderabad | msk041999@gmail.com | 9010390210 | Linkedin | GitHub | Portfolio Professional Background Data Scientist with 3.5 years of experience in Machine Learning (ML) , Natural Language Processing (NLP) , Deep Learning , Time Series, and Generative AI . Expertise in predictive modeling , time series forecasting , and statistical analysis using Python, Scikit-Learn, TensorFlow, and PyTorch. Proficient in end-to-end AI de- velopment from EDA, preprocessing, feature engineering, model building, model evaluation to deployment using Flask API and Microsoft Azure cloud services .Currently deep diving into Agentic AI architectures , RAG implementations, vector databases, embeddings, and exploring LangChain framework. Primary Skills Technical Skills • Machine Learning (ML) • Deep Learning (DL) • Natural Language Processing (NLP) • Time Series Forecasting • Exploratory Data Analysis (EDA), Data Preprocessing, Feature Engineering, Model building and Model evaluation •", "ML) • Deep Learning (DL) • Natural Language Processing (NLP) • Time Series Forecasting • Exploratory Data Analysis (EDA), Data Preprocessing, Feature Engineering, Model building and Model evaluation • Clustering • Generative Artificial Intelligence (Gen AI) • Prompt Engineering • Multi Agent Orchestration (Agentic AI) creating end to end workflows using agents Programming Languages, Frameworks, and Libraries • Python, TensorFlow, Scikit-Learn, nltk, spacy , Numpy , Pandas, Open AI, PyTorch, PyCaret , Flask, Rest API’s, DB’s (SQL, MongoDB and FAISS vector DB - Basic understanding) Development Tools and Environments • GitLab, Postman, Linux, Putty , WinSCP, Visual Studio Code (VS Code), Spyder, Eclipse, Jupyter Notebook, Ana- conda Additional Skills • Celery , Redis (Microservice Architecture) • Automation and Scripting (e.g. Python Scripting) • Microsoft Azure • Agile Methodologies • Soft Skills: Problem-Solving, Critical Thinking, and Collaboration Professional Summary • Explored and", "ure) • Automation and Scripting (e.g. Python Scripting) • Microsoft Azure • Agile Methodologies • Soft Skills: Problem-Solving, Critical Thinking, and Collaboration Professional Summary • Explored and analyzed 20+ datasets over 3 years, gaining expertise in data distributions (Gaussian, Poisson, Uniform), descriptive statistics and hypothesis testing (Z-score, T-score, null and alternative hypothesis). • Conducted Exploratory Data Analysis (EDA), and visualization using Plotly, Matplotlib, and Seaborn. • Proficient in handling missing values using imputational methods and identifying/replacing outliers, plus fea- ture engineering (encoding, scaling techniques: Standard Scaler, Min-Max; transformation techniques: log10, Box-Cox, square, square root) and feature selection (recursive feature elimination, Lasso(L1), forward/bac kward selection). • Handled class imbalance using SMOTE, SMOTETomek, and random over/under sampling , and performed cross-validation (K-Fold, Stratified K-Fold) to", "elimination, Lasso(L1), forward/bac kward selection). • Handled class imbalance using SMOTE, SMOTETomek, and random over/under sampling , and performed cross-validation (K-Fold, Stratified K-Fold) to ensure robust model performance. • Developed and deployed end-to-end ML solutions including Boeing customer tool price prediction , Cargill Major Incident prediction, Tata Steel ticket assignment, and supply chain demand forecasting(SKU/category level). • Expertise in supervised and unsupervised learning algorithms such as Random Forest, Logistic Regression, XGBoost, LightGBM, KNN, Naive Bayes, SVC, K-Means, and DBSCAN. • Improved model performance by15% accuracy and reduced runtime by20 minutes through GridSearchCV and RandomSearchCV for hyperparameter tuning and parallel processing with n_jobs. • Built and optimized NLP pipelines using text cleaning (regular expressions, stop words removal, tokenization, lemmatization), vectorization (TF-IDF, Bag of Words, Word2Vec, Sentence", "ing with n_jobs. • Built and optimized NLP pipelines using text cleaning (regular expressions, stop words removal, tokenization, lemmatization), vectorization (TF-IDF, Bag of Words, Word2Vec, Sentence Transformers - all-MiniLM-L6-V2), tokenizer and padding, along with NER, parser, and tagger, achieving 87% accuracy for sentiment analysis, 85% accuracy for ticket classification, and 99% for Major Incident prediction. • Implemented clustering solutions using K-Means, DBSCAN, and Hierarchical Clustering, leveraging Sentence Transformersfor semantic understanding andElbow Method and Silhouette Scorefor optimal cluster selection. • Integrated Generative AI solutions using Azure OpenAI, reducing costs by combining K-Means clustering with prompt engineering for concise cluster naming. • Utilized pretrained models like XLM-RoBERTa from Hugging Face for sentiment analysis and Azure Speech- to-Textfor multilingual audio transcription. • Proficient in traditional models ( ARIMA, SARIMA, SARIMAX,", "pretrained models like XLM-RoBERTa from Hugging Face for sentiment analysis and Azure Speech- to-Textfor multilingual audio transcription. • Proficient in traditional models ( ARIMA, SARIMA, SARIMAX, Prophet, Exponential Smoothing ) by ensuring stationarity (ADF/KPSS tests, differencing) and identifying parameters (ACF/PACF). • Skilled in advanced deep learning models ( N-BEATS, TFT, NHITS, LSTM, GRU ) via Darts library to handle complex stochastic trends, seasonality , and noise created covariates to handle multiple seasonalities in data. • Deep Learning Expertise: Proficient in tuning batch size, epochs, and learning ratesfor optimal performance, implementing optimizers (ADAM, SGD) and activation functions (Sigmoid, TanH, ReLU), and using dropout and pooling layers to prevent overfitting and reduce computational complexity . • Deep Learning Architectures : Hands-on experience with RNNs, LSTMs, and GANs for tasks like sequential data analysis, predictive modelling and synthetic data", "ng and reduce computational complexity . • Deep Learning Architectures : Hands-on experience with RNNs, LSTMs, and GANs for tasks like sequential data analysis, predictive modelling and synthetic data generation, including addressing vanishing gradients and implementing forward/backward propagation. • Evaluated models using classification metrics (accuracy, precision, recall, AUC score, specificity, sensitivity) and regression metrics (Rsquare, Adjusted Rsquare, MAPE, MAE, MSE, RMSE, SMAPE ), addressing high variance and high bias scenarios. • Deployed GPT and embedding models in Azure AI Foundry, configuring API connections for multi-agent sys- tems and autonomous workflows. • Developed a workflow using multiple agents on the WisdomNext platform to orchestrate the SDLC, where prompts generate products and automatically push code to Git with proper orchestration. • Started Developing Autonomous E2E Inventory Management System powered by Agentic AI on TCS Wis- domNext combining Rapid", "enerate products and automatically push code to Git with proper orchestration. • Started Developing Autonomous E2E Inventory Management System powered by Agentic AI on TCS Wis- domNext combining Rapid AI forecasting with GenAI reasoning for end-to-end automation. • Created Reasoning AI agent workflow that interpret RapidAI predictions and generate explanation about why model has predicted this value(provided each feature addtional information and feature importance score of ML model). Experience Project - 1: TCS Cognix™ Rapid AI (Current) November 2022 – Present Client: Tata Consultancy Services Role: Data Scientist Roles and Responsibilities: • Developed and maintained Jupyter notebooks for various datasets, streamlining data preprocessing, model development, and evaluation. • Designed and deployed AI solutions tailored to business needs, ensuring automation and data-driven decision- making. • Optimized AI workflows by implementing efficient data handling, feature engineering, and", "d and deployed AI solutions tailored to business needs, ensuring automation and data-driven decision- making. • Optimized AI workflows by implementing efficient data handling, feature engineering, and model tuning techniques. • Integrated multiple ML and DL algorithms into the platform, improving prediction accuracy and clustering capabilities. • Developed E2E time series forecasting solutions to business data. • Worked on speech-to-text transcription and audio data analysis, enabling multilingual processing. • Conducted rigorous testing and Validated models using appropriate evaluation metrics to ensure reliability and scalability . • Documented processes and findings, ensuring reproducibility and knowledge sharing. • Collaborated with cross-functional teams to translate business problems into AI-driven solutions. Project - 2: Machine First Delivery Model™ (MFDM™).AI March 2022 – October 2022 Client: Tata Consultancy Services Role: AIML Developer Roles and Responsibilities: •", "problems into AI-driven solutions. Project - 2: Machine First Delivery Model™ (MFDM™).AI March 2022 – October 2022 Client: Tata Consultancy Services Role: AIML Developer Roles and Responsibilities: • Developed multiple Jupyter notebooks for various use cases, including Topic Modeling and Sentiment Anal- ysis. • Built predictive models for app installation through ads using machine learning algorithms. • Developed AI solutions for employee attrition prediction and bank customer churn analysis. • Enhanced pre-existing notebooks, making them ready for seamless integration with applications for busi- ness users. • Deployed machine learning models as Flask APIs, enabling real-time predictions and accessibility . Education JNTUK afflitiated VSM College Of Engineering And Technology , B.Tech in Me- chanical Engineering July 2016 – September 2020 • CGPA: 7.82 Achievements • Promoted to Innovator role (Ninja → Digital → Innovator) at TCS by clearing Elevate Wings exams with dis- tinction in", "in Me- chanical Engineering July 2016 – September 2020 • CGPA: 7.82 Achievements • Promoted to Innovator role (Ninja → Digital → Innovator) at TCS by clearing Elevate Wings exams with dis- tinction in all tracks: Articulation, Business Skills, Process, Core Full Stack (Data Science) , and Core Pro- gramming (Python), and being selected for HiTalent Associate program. • Achieved A Band rating and recognized as Star Performer in the team during last financial year • Honored with the Best Mentor Award, Badge, and Special Lanyardfor mentoring associates to complete the AI Practitioner certification. • Awarded by GEMS for multiple achievements, including the Xcelerate Warrior Certificate and MFDM AI Prac- titioner Certification. Certifications • Earned Microsoft Certified: Agentic AI Project Ready professional badge • Completed Udemy certifications in Deep Learning, Machine Learning, Time Series Analysis, and Probability and Statistics all are availble in my linkedin page. • Achieved MFDM", "Ready professional badge • Completed Udemy certifications in Deep Learning, Machine Learning, Time Series Analysis, and Probability and Statistics all are availble in my linkedin page. • Achieved MFDM AI Practitioner Intermediate certification from TCS Declaration I hereby declare that the information provided above is true and accurate to the best of my knowledge.", "Avik Biswas Principal Data Scientist Bengaluru, India | +91-8095706732 | aviksagi@gmail.com | linkedin.com/in/avik-biswas-stats Profile Summary • Over 15 years of experience in AI/ML, Data Science, and Advanced Analytics across automotive, manufacturing, and retail. • Specialized in IoT/Telematics, Predictive Modeling, Machine Learning, Deep Learning and Statistical Analysis . • Expertise in deriving actionable insights from high-volume structured and unstructured data. • Experience in leading and mentoring data scientists to deliver high performance results. • Work alongside data engineering and product teams to implement end -to-end analytics solutions within enterprise platforms. Professional Experience DARBY TELEMATICS | PRINCIPAL DATA SCIENTIST | APRIL 2024 – PRESENT Developed analytics modules for C6 Insights, a climate tech and fleet optimization platform, that helps customers reduce fuel spend, measure and report carbon emissions, and evaluate ROI on clean technologies to", "nalytics modules for C6 Insights, a climate tech and fleet optimization platform, that helps customers reduce fuel spend, measure and report carbon emissions, and evaluate ROI on clean technologies to support net-zero goals. • Enhanced platform’s core vehicle replacement optimization engine , enabling fleets to build priority -based replacement roadmaps that maximize cost savings (~$4M annually) and reduce emissions, while ensuring smooth operational continuity. • Developed a predictive model for fuel consumption incorporating driver behaviour (idling, acceleration, braking) and telematics signals, improving customer fuel-efficiency insights and driving measurable savings across fleet. • Built a regression model for ICE vehicle fuel economy using speed, behaviour, and terrain data; introduced a fleet -level scoring system that allowed customers to benchmark performance and take targeted improvement actions. • Designed a nonlinear depreciation model (sigmoid -based) to estimate vehicle", "uced a fleet -level scoring system that allowed customers to benchmark performance and take targeted improvement actions. • Designed a nonlinear depreciation model (sigmoid -based) to estimate vehicle resale value, supporting data-driven decisions for value optimization and replacement planning. • Created a financial scenario modelling tool (fuel switching, technology upgrades, vehicle replacements) using ROI and Payback Period analysis; integrated directly into the platform so customers could evaluate strategies in one place. • Implemented anomaly detection algorithms to identify irregularities in telematics -reported data, improving the reliability of platform’s (improved data accuracy by ~30%) analytics and strengthening customer confidence in platform outputs. • Built a utilization-based vehicle rating system to benchmark fleets, helping customers identify under- and over-used assets. DANLAW INC. | PRINCIPAL DATA SCIENTIST | OCTOBER 2018 – MARCH 2024 Developed analytics modules", "-based vehicle rating system to benchmark fleets, helping customers identify under- and over-used assets. DANLAW INC. | PRINCIPAL DATA SCIENTIST | OCTOBER 2018 – MARCH 2024 Developed analytics modules for DeepView Analytics, a telematics platform, that processes high-frequency OBD-II data from vehicles to deliver insights into vehicle health (ICE and EV), driver behaviour, road conditions and fleet performance. • Built a CNN-based model using accelerometer and speed data, enabling the platform to detect rough terrain and improve road condition assessments for fleet operators. • Developed regression -based EV range prediction models incorporating battery capacity, speed, terrain, and temperature, empowering customers to plan trips and reduce range -anxiety for electric fleets. • Designed algorithms leveraging State of Charge (SOC) data to classify charging and discharging events, providing customers with actionable EV charging behavior insights within the platform. • Created an EV", "ned algorithms leveraging State of Charge (SOC) data to classify charging and discharging events, providing customers with actionable EV charging behavior insights within the platform. • Created an EV battery health prediction model , enabling proactive maintenance and minimizing downtime, which improved fleet reliability and reduced costs. • Implemented a Mahalanobis Distance -based anomaly detection model for Vehicle Health Monitoring, identifying potential sub-component failures early in the platform’s predictive maintenance capabilities. • Developed Python algorithms to detect fuel pilferage in ICE vehicles, reducing theft-related losses and providing a key differentiator for DeepView Analytics in cost-sensitive markets. • Built interactive dashboards with R-Shiny and Python Dash that visualized fleet health, driver behavior, and utilization metrics, enhancing customer decision-making and engagement. Page 2 TATA CONSULTANCY SERVICES | SENIOR DATA SCIENTIST | MAY 2010 – OCTOBER", "that visualized fleet health, driver behavior, and utilization metrics, enhancing customer decision-making and engagement. Page 2 TATA CONSULTANCY SERVICES | SENIOR DATA SCIENTIST | MAY 2010 – OCTOBER 2018 • Text Analytics on Net Promoter Score (Recommend & Improve) Comments by Customers: o Developed a text classification model to analyse customer comments from Net Promoter Score (NPS) feedback, categorizing them into \" Recommend\" and \" Improve\" themes. Enabled efficient identification of customer sentiments and actionable insights. Built a dynamic dashboard in Excel, enabling stakeholders to interact with the data & view key trends. • Detecting Anomalous Machine Units Manufacturing Electrical Equipment: o Developed a distribution -based solution using the Multivariate Normal Distribution to detect anomalies by analysing patterns between two selected device measures, identifying deviations in the production process. • Warranty Claims Prediction and Cost Prediction of Engines o", "ribution to detect anomalies by analysing patterns between two selected device measures, identifying deviations in the production process. • Warranty Claims Prediction and Cost Prediction of Engines o Developed a warranty predictor tool using the Generalized Renewal Process to estimate the expected number of warranty claims and associated costs for engines over their warranty period, simplifying the complexity and improving prediction accuracy. • Root Cause Analysis of Accounts Receivables Disputes Data Using Text Mining Approach: o Developed a text analytics model using Regular Expressions , SVM, and Random Forest to classify customer dispute notes into root cause categories such as invoice discrepancies and quantity mismatches. • GKPI Automation (Lean Six Sigma Green Belt Certification): o Created an Excel Based automation template using Excel VBA. o TAT Reduction: 92% & Accuracy Improvement: ~85% (saved ~$57,000, implemented across all MEAP countries). Educational Qualification •", "n): o Created an Excel Based automation template using Excel VBA. o TAT Reduction: 92% & Accuracy Improvement: ~85% (saved ~$57,000, implemented across all MEAP countries). Educational Qualification • M.Sc. Statistics | 2008-2010 | University of Madras, Chennai • B.Sc. Statistics (Hons.) | 2003-2006 | Calcutta University, Kolkata Analytical Skills • Predictive Modelling • Gen AI/LLM • Time series/Forecasting • Principal Component Analysis • Anomaly/Outlier Detection • Deep Learning: CNN, LSTM • Random Forest/ SVM/ XGBoost • Clustering: K-Means, GMM, DBSCAN • Linear Programming/Optimization Technical Skills • Python • Multiprocessing • MongoDB • R/R-Shiny • Python Dash • Advanced MS Excel • Pandas/Numpy/Scipy • Scikit-learn/Statsmodels • Tensorflow/Keras Key Strengths • Stakeholder Management: Consistently engage with leadership, engineering, and product teams to align on goals . • Team Mentorship: Mentored junior data scientists and facilitated internal knowledge -sharing sessions to", "ment: Consistently engage with leadership, engineering, and product teams to align on goals . • Team Mentorship: Mentored junior data scientists and facilitated internal knowledge -sharing sessions to boost skills. • Cross-Functional Collaboration: Led end-to-end solution delivery working closely with product and engineering teams. Peer-Reviewed Publication • Sabapathy, A., Biswas, A. 2023. Road surface classification using accelerometer and speed data: evaluation of a convolutional neural network model. Neural Computing and Applications 35 (19): 14183–14194.", "PANKAJ SHARMA +91 9226915581 | maverickpankaj007@gmail.com PROFILE Results-driven AI/ML and Data Analytics professional with 5+ years of hands-on experience in building machine learning models, PEFT using LoRA, QLoRA for optimisation, building knowledge graph for deeper analysis, extracting actionable insights from data, and deploying end-to-end data solutions. Proven ability to translate business challenges into data-driven strategies using Python, Pytorch, tensorflow, vectorDB, SQL, and advanced ML algorithms. Skilled in data visualization, predictive modeling, and statistical analysis, using langchain, hugging face models, with a strong foundation in mathematics and computer science. Adept at working with cross-functional teams to deliver measurable impact in real- world applications across finance, healthcare, and e-commerce sectors. Using dockers , containers for devops and LoRA, QLoRa, with PEFT for efficeint utilisation of memory and processing, Retrieval-Augmented Generation", "across finance, healthcare, and e-commerce sectors. Using dockers , containers for devops and LoRA, QLoRa, with PEFT for efficeint utilisation of memory and processing, Retrieval-Augmented Generation (RAG), and Multi-Modal AI Systems with expertise in Amazon SageMaker and S3 for data lakes, Power BI tools for data visualization. CORE COMPETENCIES - Artificial Intelligence & Machine Learning (LLMs, RAG, Guardrails, Agentic AI) - Vector Databases (FAISS, Pinecone) & Knowledge Graphs - Multi-Modal AI Systems (text, vision, structured data) - Predictive Analytics & Decision Support Systems - Railway Safety & Reliability (RAMS) - Project Planning, Execution & Commissioning - Cross-Functional Team Leadership & Innovation - Expertise in Amazon SageMaker and S3 for data lakes Power BI tools for data visualization PROFESSIONAL EXPERIENCE Indian Railways – Deputy General Manager (DGM) Dec 2013 – OCT 2025 - Spearheaded the first vector database–powered AI system at Indian Railways, enabling", "for data visualization PROFESSIONAL EXPERIENCE Indian Railways – Deputy General Manager (DGM) Dec 2013 – OCT 2025 - Spearheaded the first vector database–powered AI system at Indian Railways, enabling real-time retrieval and operational intelligence. - Designed and deployed an agentic RAG framework with re-ranking, guardrails, and data- leak prevention, ensuring secure and context-aware outputs. - Integrated structured, unstructured, and IoT sensor data into multi-modal databases for advanced decision-making. - Led development of predictive maintenance models to forecast accidents, improve asset reliability, and reduce downtime. - Hands-on in building ML pipelines with Python, PyTorch, TensorFlow, SQL, leveraging LoRA/QLoRA, PEFT, Hugging Face, LangChain, and containerized deployment (Docker, Kubernetes) , Retrieval-Augmented Generation (RAG), and Multi-Modal AI Systems with expertise in Amazon SageMaker and S3 for data lakes, PowerBI tools for data visualization - Collaborated with", "ocker, Kubernetes) , Retrieval-Augmented Generation (RAG), and Multi-Modal AI Systems with expertise in Amazon SageMaker and S3 for data lakes, PowerBI tools for data visualization - Collaborated with finance, healthcare, and e-commerce partners to extend AI solutions beyond railways. Compro Technologies – Software Developer Dec 2010 – Dec 2012 - Delivered enterprise-scale web applications using C#, .NET, SQL Server, MySQL, HTML5, jQuery, and Web Services. - Designed and optimized database backends for high-performance systems. - Built strong foundations in SDLC, software design, and system integration. PROJECTS - Decision Support System: Using RAG and PEFT post trained LLM for creation of decision support system, using 13 departments’ data to build a specialized model with evaluation and performance metrics benchmarked to ROUGE and BERT score - Video Surveillance Systems – Face recognition system for live streamed data using OPenCV and LLM for creation of alerts and seamless", "ation and performance metrics benchmarked to ROUGE and BERT score - Video Surveillance Systems – Face recognition system for live streamed data using OPenCV and LLM for creation of alerts and seamless integration across 233 stations - Railway Chatbot (Agentic RAG System) – Built Indian Railways’ first agentic chatbot handling 100K+ requests daily; used transformers for embeddings, FAISS HNSW for retrievals, LoRA/QLoRA for efficiency, and guardrails for secure AI interactions. - AI Decision Support System – Created a vector DB integrating multiple data sources; delivered predictive analytics for accident trends and asset maintenance forecasting. EDUCATION - B.Tech, Electronics & Communication Engineering – Ajay Kumar Garg Engineering College, Ghaziabad | 2010 | 80.08% - XII – KDB Public School, Ghaziabad | 2006 | 81.4% (CBSE) - X – Ingraham Institute, Ghaziabad | 2004 | 79.8% (ICSE) GLOBAL CERTIFICATION & TRAINING - AWS S3, Sagemaker certification - 18-Months Training, Indian Railways:", "hool, Ghaziabad | 2006 | 81.4% (CBSE) - X – Ingraham Institute, Ghaziabad | 2004 | 79.8% (ICSE) GLOBAL CERTIFICATION & TRAINING - AWS S3, Sagemaker certification - 18-Months Training, Indian Railways: RRI (German & British), EI (Microlok, Westrace, SIMIS S20), SDH STM, ERTMS L1/2/3, CBTC, GSM-R. - Equivalent to IRSE Certification eligibility. KEY STRENGTHS - AI Solutions Architect & Innovator - Railway Digital Transformation Specialist - Strategic Leader with Execution Focus - Passion for Emerging Technologies Ghaziabad, U.P. | Nationality: Indian", "Sanjeev Kumar Noida, India | +91 7289909687 | sksanjeevkumar489@gmail.com | linkedin.com/in/sanjeev- k-6b2490b9 OBJECTIVE GeneraGve AI Engineer with 6.5 years of experience designing, developing, and deploying scalable AI soluGons on cloud-naGve plaRorms including Azure, AWS, and Google Cloud. Proven experGse in LLM-powered applicaGons, prompt engineering, AgenGc AI, and cloud infrastructure automaGon. Seeking to deliver innovaGve GenAI soluGons blending cuYng-edge AI research with producGon-grade cloud scalability. SKILLS • GeneraGve AI & ML: Python, Prompt Engineering, LLMs (GPT-3.5, GPT-4, LLaMA), LangChain, AgenGc AI, LangGraph, RAG, OpenAI API, Microsoc Copilot Studio • Cloud PlaRorms: Azure (OpenAI, FuncGons, CogniGve Services, Copilot Studio), AWS, Google Cloud (Vertex AI) • Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy", "Frameworks & Tools: Terraform, Docker, crewAI, AI Reﬁnery, FastAPI • Databases: CosmosDB, PostgreSQL, MongoDB, Pinecone Vector DB, Redis PROFESSIONAL EXPERIENCE GeneraGve AI Engineer Tata Consultancy Services (TCS) — Jan 2025 – Present | Noida, India • Designed and deployed enterprise GenAI chatbots and workﬂow automaGon soluGons leveraging Python, OpenAI GPT-4, LangChain, and MicrosoD Copilot Studio. • Implemented agenGc AI automaGon workﬂows, integraGng Microsoc Copilot Studio for rapid agent development and orchestraGon. • Architected cloud-naGve AI deployments on Azure and Google Cloud (Vertex AI) to maximize scalability, fault tolerance, and performance. • Applied advanced prompt engineering methodologies (zero/one/few-shot, RAG) to improve user experience and system accuracy. • Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and", "• Automated AI soluGon delivery pipelines using Terraform, Docker, and serverless Azure FuncGons. GeneraGve AI Engineer Capgemini — Jan 2024 – Jan 2025 • Developed and maintained knowledge agents and chatbots using OpenAI, LangChain, and Google Vertex AI, improving customer interacGon automaGon. • Automated cloud infrastructure provisioning using Terraform for scalable GenAI services on Azure and Google Cloud. • Led AI pipeline CI/CD incorporaGng model training, tesGng, and deployment. • Pioneered adopGon of MicrosoD Copilot Studio for enterprise agent prototypes and AI service integraGon. GeneraGve AI Engineer Infosys — Dec 2021 – Jan 2024 • Built producGon-grade GenAI assistants uGlizing LangGraph and Azure cloud AI services. • Integrated various cloud databases and vector search engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 •", "h engines for real-Gme LLM retrieval- augmented generaRon (RAG). • Awarded Infosys Insta Award for DevOps and GeneraGve AI automaGon excellence. Junior DevOps Engineer NTT DATA — Jul 2019 – Nov 2021 • Automated cloud provisioning and container orchestraGon pipelines, supporGng AI data workloads. GENAI PROJECT HIGHLIGHTS • Delivered highly scalable, producGon-level GenAI chatbots with GPT and LangChain, opGmized through advanced prompt engineering. • Led automaGon and integraGon of large-scale AI workﬂows using Microsoc Copilot Studio and Google Vertex AI. • Implemented seamless AI applicaGon deployment using Terraform on mulG-cloud environments. • Developed robust vector search systems integraGng Pinecone, CosmosDB, and relaGonal databases for AI applicaGons. CERTIFICATIONS & BADGES • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon", "S • Google CerRﬁed GeneraRve AI Leader • MicrosoD Skilled Badge in AgenRc AI • AWS CerGﬁed Cloud PracGGoner & Microsoc CerGﬁed: Azure Fundamentals (AZ-900) EDUCATION B.Tech, Electronics & CommunicaGon Engineering Dr. A.P .J. Abdul Kalam Technical University (2015–2019)", "Syam Kumar Mandapati Hyderabad | msk041999@gmail.com | 9010390210 | Linkedin | GitHub | Portfolio Professional Background Data Scientist with 3.5 years of experience in Machine Learning (ML) , Natural Language Processing (NLP) , Deep Learning , Time Series, and Generative AI . Expertise in predictive modeling , time series forecasting , and statistical analysis using Python, Scikit-Learn, TensorFlow, and PyTorch. Proficient in end-to-end AI de- velopment from EDA, preprocessing, feature engineering, model building, model evaluation to deployment using Flask API and Microsoft Azure cloud services .Currently deep diving into Agentic AI architectures , RAG implementations, vector databases, embeddings, and exploring LangChain framework. Primary Skills Technical Skills • Machine Learning (ML) • Deep Learning (DL) • Natural Language Processing (NLP) • Time Series Forecasting • Exploratory Data Analysis (EDA), Data Preprocessing, Feature Engineering, Model building and Model evaluation •", "ML) • Deep Learning (DL) • Natural Language Processing (NLP) • Time Series Forecasting • Exploratory Data Analysis (EDA), Data Preprocessing, Feature Engineering, Model building and Model evaluation • Clustering • Generative Artificial Intelligence (Gen AI) • Prompt Engineering • Multi Agent Orchestration (Agentic AI) creating end to end workflows using agents Programming Languages, Frameworks, and Libraries • Python, TensorFlow, Scikit-Learn, nltk, spacy , Numpy , Pandas, Open AI, PyTorch, PyCaret , Flask, Rest API’s, DB’s (SQL, MongoDB and FAISS vector DB - Basic understanding) Development Tools and Environments • GitLab, Postman, Linux, Putty , WinSCP, Visual Studio Code (VS Code), Spyder, Eclipse, Jupyter Notebook, Ana- conda Additional Skills • Celery , Redis (Microservice Architecture) • Automation and Scripting (e.g. Python Scripting) • Microsoft Azure • Agile Methodologies • Soft Skills: Problem-Solving, Critical Thinking, and Collaboration Professional Summary • Explored and", "ure) • Automation and Scripting (e.g. Python Scripting) • Microsoft Azure • Agile Methodologies • Soft Skills: Problem-Solving, Critical Thinking, and Collaboration Professional Summary • Explored and analyzed 20+ datasets over 3 years, gaining expertise in data distributions (Gaussian, Poisson, Uniform), descriptive statistics and hypothesis testing (Z-score, T-score, null and alternative hypothesis). • Conducted Exploratory Data Analysis (EDA), and visualization using Plotly, Matplotlib, and Seaborn. • Proficient in handling missing values using imputational methods and identifying/replacing outliers, plus fea- ture engineering (encoding, scaling techniques: Standard Scaler, Min-Max; transformation techniques: log10, Box-Cox, square, square root) and feature selection (recursive feature elimination, Lasso(L1), forward/bac kward selection). • Handled class imbalance using SMOTE, SMOTETomek, and random over/under sampling , and performed cross-validation (K-Fold, Stratified K-Fold) to", "elimination, Lasso(L1), forward/bac kward selection). • Handled class imbalance using SMOTE, SMOTETomek, and random over/under sampling , and performed cross-validation (K-Fold, Stratified K-Fold) to ensure robust model performance. • Developed and deployed end-to-end ML solutions including Boeing customer tool price prediction , Cargill Major Incident prediction, Tata Steel ticket assignment, and supply chain demand forecasting(SKU/category level). • Expertise in supervised and unsupervised learning algorithms such as Random Forest, Logistic Regression, XGBoost, LightGBM, KNN, Naive Bayes, SVC, K-Means, and DBSCAN. • Improved model performance by15% accuracy and reduced runtime by20 minutes through GridSearchCV and RandomSearchCV for hyperparameter tuning and parallel processing with n_jobs. • Built and optimized NLP pipelines using text cleaning (regular expressions, stop words removal, tokenization, lemmatization), vectorization (TF-IDF, Bag of Words, Word2Vec, Sentence", "ing with n_jobs. • Built and optimized NLP pipelines using text cleaning (regular expressions, stop words removal, tokenization, lemmatization), vectorization (TF-IDF, Bag of Words, Word2Vec, Sentence Transformers - all-MiniLM-L6-V2), tokenizer and padding, along with NER, parser, and tagger, achieving 87% accuracy for sentiment analysis, 85% accuracy for ticket classification, and 99% for Major Incident prediction. • Implemented clustering solutions using K-Means, DBSCAN, and Hierarchical Clustering, leveraging Sentence Transformersfor semantic understanding andElbow Method and Silhouette Scorefor optimal cluster selection. • Integrated Generative AI solutions using Azure OpenAI, reducing costs by combining K-Means clustering with prompt engineering for concise cluster naming. • Utilized pretrained models like XLM-RoBERTa from Hugging Face for sentiment analysis and Azure Speech- to-Textfor multilingual audio transcription. • Proficient in traditional models ( ARIMA, SARIMA, SARIMAX,", "pretrained models like XLM-RoBERTa from Hugging Face for sentiment analysis and Azure Speech- to-Textfor multilingual audio transcription. • Proficient in traditional models ( ARIMA, SARIMA, SARIMAX, Prophet, Exponential Smoothing ) by ensuring stationarity (ADF/KPSS tests, differencing) and identifying parameters (ACF/PACF). • Skilled in advanced deep learning models ( N-BEATS, TFT, NHITS, LSTM, GRU ) via Darts library to handle complex stochastic trends, seasonality , and noise created covariates to handle multiple seasonalities in data. • Deep Learning Expertise: Proficient in tuning batch size, epochs, and learning ratesfor optimal performance, implementing optimizers (ADAM, SGD) and activation functions (Sigmoid, TanH, ReLU), and using dropout and pooling layers to prevent overfitting and reduce computational complexity . • Deep Learning Architectures : Hands-on experience with RNNs, LSTMs, and GANs for tasks like sequential data analysis, predictive modelling and synthetic data", "ng and reduce computational complexity . • Deep Learning Architectures : Hands-on experience with RNNs, LSTMs, and GANs for tasks like sequential data analysis, predictive modelling and synthetic data generation, including addressing vanishing gradients and implementing forward/backward propagation. • Evaluated models using classification metrics (accuracy, precision, recall, AUC score, specificity, sensitivity) and regression metrics (Rsquare, Adjusted Rsquare, MAPE, MAE, MSE, RMSE, SMAPE ), addressing high variance and high bias scenarios. • Deployed GPT and embedding models in Azure AI Foundry, configuring API connections for multi-agent sys- tems and autonomous workflows. • Developed a workflow using multiple agents on the WisdomNext platform to orchestrate the SDLC, where prompts generate products and automatically push code to Git with proper orchestration. • Started Developing Autonomous E2E Inventory Management System powered by Agentic AI on TCS Wis- domNext combining Rapid", "enerate products and automatically push code to Git with proper orchestration. • Started Developing Autonomous E2E Inventory Management System powered by Agentic AI on TCS Wis- domNext combining Rapid AI forecasting with GenAI reasoning for end-to-end automation. • Created Reasoning AI agent workflow that interpret RapidAI predictions and generate explanation about why model has predicted this value(provided each feature addtional information and feature importance score of ML model). Experience Project - 1: TCS Cognix™ Rapid AI (Current) November 2022 – Present Client: Tata Consultancy Services Role: Data Scientist Roles and Responsibilities: • Developed and maintained Jupyter notebooks for various datasets, streamlining data preprocessing, model development, and evaluation. • Designed and deployed AI solutions tailored to business needs, ensuring automation and data-driven decision- making. • Optimized AI workflows by implementing efficient data handling, feature engineering, and", "d and deployed AI solutions tailored to business needs, ensuring automation and data-driven decision- making. • Optimized AI workflows by implementing efficient data handling, feature engineering, and model tuning techniques. • Integrated multiple ML and DL algorithms into the platform, improving prediction accuracy and clustering capabilities. • Developed E2E time series forecasting solutions to business data. • Worked on speech-to-text transcription and audio data analysis, enabling multilingual processing. • Conducted rigorous testing and Validated models using appropriate evaluation metrics to ensure reliability and scalability . • Documented processes and findings, ensuring reproducibility and knowledge sharing. • Collaborated with cross-functional teams to translate business problems into AI-driven solutions. Project - 2: Machine First Delivery Model™ (MFDM™).AI March 2022 – October 2022 Client: Tata Consultancy Services Role: AIML Developer Roles and Responsibilities: •", "problems into AI-driven solutions. Project - 2: Machine First Delivery Model™ (MFDM™).AI March 2022 – October 2022 Client: Tata Consultancy Services Role: AIML Developer Roles and Responsibilities: • Developed multiple Jupyter notebooks for various use cases, including Topic Modeling and Sentiment Anal- ysis. • Built predictive models for app installation through ads using machine learning algorithms. • Developed AI solutions for employee attrition prediction and bank customer churn analysis. • Enhanced pre-existing notebooks, making them ready for seamless integration with applications for busi- ness users. • Deployed machine learning models as Flask APIs, enabling real-time predictions and accessibility . Education JNTUK afflitiated VSM College Of Engineering And Technology , B.Tech in Me- chanical Engineering July 2016 – September 2020 • CGPA: 7.82 Achievements • Promoted to Innovator role (Ninja → Digital → Innovator) at TCS by clearing Elevate Wings exams with dis- tinction in", "in Me- chanical Engineering July 2016 – September 2020 • CGPA: 7.82 Achievements • Promoted to Innovator role (Ninja → Digital → Innovator) at TCS by clearing Elevate Wings exams with dis- tinction in all tracks: Articulation, Business Skills, Process, Core Full Stack (Data Science) , and Core Pro- gramming (Python), and being selected for HiTalent Associate program. • Achieved A Band rating and recognized as Star Performer in the team during last financial year • Honored with the Best Mentor Award, Badge, and Special Lanyardfor mentoring associates to complete the AI Practitioner certification. • Awarded by GEMS for multiple achievements, including the Xcelerate Warrior Certificate and MFDM AI Prac- titioner Certification. Certifications • Earned Microsoft Certified: Agentic AI Project Ready professional badge • Completed Udemy certifications in Deep Learning, Machine Learning, Time Series Analysis, and Probability and Statistics all are availble in my linkedin page. • Achieved MFDM", "Ready professional badge • Completed Udemy certifications in Deep Learning, Machine Learning, Time Series Analysis, and Probability and Statistics all are availble in my linkedin page. • Achieved MFDM AI Practitioner Intermediate certification from TCS Declaration I hereby declare that the information provided above is true and accurate to the best of my knowledge.", "Avik Biswas Principal Data Scientist Bengaluru, India | +91-8095706732 | aviksagi@gmail.com | linkedin.com/in/avik-biswas-stats Profile Summary • Over 15 years of experience in AI/ML, Data Science, and Advanced Analytics across automotive, manufacturing, and retail. • Specialized in IoT/Telematics, Predictive Modeling, Machine Learning, Deep Learning and Statistical Analysis . • Expertise in deriving actionable insights from high-volume structured and unstructured data. • Experience in leading and mentoring data scientists to deliver high performance results. • Work alongside data engineering and product teams to implement end -to-end analytics solutions within enterprise platforms. Professional Experience DARBY TELEMATICS | PRINCIPAL DATA SCIENTIST | APRIL 2024 – PRESENT Developed analytics modules for C6 Insights, a climate tech and fleet optimization platform, that helps customers reduce fuel spend, measure and report carbon emissions, and evaluate ROI on clean technologies to", "nalytics modules for C6 Insights, a climate tech and fleet optimization platform, that helps customers reduce fuel spend, measure and report carbon emissions, and evaluate ROI on clean technologies to support net-zero goals. • Enhanced platform’s core vehicle replacement optimization engine , enabling fleets to build priority -based replacement roadmaps that maximize cost savings (~$4M annually) and reduce emissions, while ensuring smooth operational continuity. • Developed a predictive model for fuel consumption incorporating driver behaviour (idling, acceleration, braking) and telematics signals, improving customer fuel-efficiency insights and driving measurable savings across fleet. • Built a regression model for ICE vehicle fuel economy using speed, behaviour, and terrain data; introduced a fleet -level scoring system that allowed customers to benchmark performance and take targeted improvement actions. • Designed a nonlinear depreciation model (sigmoid -based) to estimate vehicle", "uced a fleet -level scoring system that allowed customers to benchmark performance and take targeted improvement actions. • Designed a nonlinear depreciation model (sigmoid -based) to estimate vehicle resale value, supporting data-driven decisions for value optimization and replacement planning. • Created a financial scenario modelling tool (fuel switching, technology upgrades, vehicle replacements) using ROI and Payback Period analysis; integrated directly into the platform so customers could evaluate strategies in one place. • Implemented anomaly detection algorithms to identify irregularities in telematics -reported data, improving the reliability of platform’s (improved data accuracy by ~30%) analytics and strengthening customer confidence in platform outputs. • Built a utilization-based vehicle rating system to benchmark fleets, helping customers identify under- and over-used assets. DANLAW INC. | PRINCIPAL DATA SCIENTIST | OCTOBER 2018 – MARCH 2024 Developed analytics modules", "-based vehicle rating system to benchmark fleets, helping customers identify under- and over-used assets. DANLAW INC. | PRINCIPAL DATA SCIENTIST | OCTOBER 2018 – MARCH 2024 Developed analytics modules for DeepView Analytics, a telematics platform, that processes high-frequency OBD-II data from vehicles to deliver insights into vehicle health (ICE and EV), driver behaviour, road conditions and fleet performance. • Built a CNN-based model using accelerometer and speed data, enabling the platform to detect rough terrain and improve road condition assessments for fleet operators. • Developed regression -based EV range prediction models incorporating battery capacity, speed, terrain, and temperature, empowering customers to plan trips and reduce range -anxiety for electric fleets. • Designed algorithms leveraging State of Charge (SOC) data to classify charging and discharging events, providing customers with actionable EV charging behavior insights within the platform. • Created an EV", "ned algorithms leveraging State of Charge (SOC) data to classify charging and discharging events, providing customers with actionable EV charging behavior insights within the platform. • Created an EV battery health prediction model , enabling proactive maintenance and minimizing downtime, which improved fleet reliability and reduced costs. • Implemented a Mahalanobis Distance -based anomaly detection model for Vehicle Health Monitoring, identifying potential sub-component failures early in the platform’s predictive maintenance capabilities. • Developed Python algorithms to detect fuel pilferage in ICE vehicles, reducing theft-related losses and providing a key differentiator for DeepView Analytics in cost-sensitive markets. • Built interactive dashboards with R-Shiny and Python Dash that visualized fleet health, driver behavior, and utilization metrics, enhancing customer decision-making and engagement. Page 2 TATA CONSULTANCY SERVICES | SENIOR DATA SCIENTIST | MAY 2010 – OCTOBER", "that visualized fleet health, driver behavior, and utilization metrics, enhancing customer decision-making and engagement. Page 2 TATA CONSULTANCY SERVICES | SENIOR DATA SCIENTIST | MAY 2010 – OCTOBER 2018 • Text Analytics on Net Promoter Score (Recommend & Improve) Comments by Customers: o Developed a text classification model to analyse customer comments from Net Promoter Score (NPS) feedback, categorizing them into \" Recommend\" and \" Improve\" themes. Enabled efficient identification of customer sentiments and actionable insights. Built a dynamic dashboard in Excel, enabling stakeholders to interact with the data & view key trends. • Detecting Anomalous Machine Units Manufacturing Electrical Equipment: o Developed a distribution -based solution using the Multivariate Normal Distribution to detect anomalies by analysing patterns between two selected device measures, identifying deviations in the production process. • Warranty Claims Prediction and Cost Prediction of Engines o", "ribution to detect anomalies by analysing patterns between two selected device measures, identifying deviations in the production process. • Warranty Claims Prediction and Cost Prediction of Engines o Developed a warranty predictor tool using the Generalized Renewal Process to estimate the expected number of warranty claims and associated costs for engines over their warranty period, simplifying the complexity and improving prediction accuracy. • Root Cause Analysis of Accounts Receivables Disputes Data Using Text Mining Approach: o Developed a text analytics model using Regular Expressions , SVM, and Random Forest to classify customer dispute notes into root cause categories such as invoice discrepancies and quantity mismatches. • GKPI Automation (Lean Six Sigma Green Belt Certification): o Created an Excel Based automation template using Excel VBA. o TAT Reduction: 92% & Accuracy Improvement: ~85% (saved ~$57,000, implemented across all MEAP countries). Educational Qualification •", "n): o Created an Excel Based automation template using Excel VBA. o TAT Reduction: 92% & Accuracy Improvement: ~85% (saved ~$57,000, implemented across all MEAP countries). Educational Qualification • M.Sc. Statistics | 2008-2010 | University of Madras, Chennai • B.Sc. Statistics (Hons.) | 2003-2006 | Calcutta University, Kolkata Analytical Skills • Predictive Modelling • Gen AI/LLM • Time series/Forecasting • Principal Component Analysis • Anomaly/Outlier Detection • Deep Learning: CNN, LSTM • Random Forest/ SVM/ XGBoost • Clustering: K-Means, GMM, DBSCAN • Linear Programming/Optimization Technical Skills • Python • Multiprocessing • MongoDB • R/R-Shiny • Python Dash • Advanced MS Excel • Pandas/Numpy/Scipy • Scikit-learn/Statsmodels • Tensorflow/Keras Key Strengths • Stakeholder Management: Consistently engage with leadership, engineering, and product teams to align on goals . • Team Mentorship: Mentored junior data scientists and facilitated internal knowledge -sharing sessions to", "ment: Consistently engage with leadership, engineering, and product teams to align on goals . • Team Mentorship: Mentored junior data scientists and facilitated internal knowledge -sharing sessions to boost skills. • Cross-Functional Collaboration: Led end-to-end solution delivery working closely with product and engineering teams. Peer-Reviewed Publication • Sabapathy, A., Biswas, A. 2023. Road surface classification using accelerometer and speed data: evaluation of a convolutional neural network model. Neural Computing and Applications 35 (19): 14183–14194."]